# -*- coding:utf-8 -*-

# 无须修改文件名，新增打开文件的功能、
# 修正了一项数组错误，该错误导致出错行的获取少了一项
# 增加了额外字典文件extra_dic.txt，该字典可增删条目(增加的条目导致程序错误率上升时可删除该条目)
# 引入了数据库持久化存储
# 输入框标签左对齐
# 增加重置默认数据库功能,重置dic-shelve和删除extra_dic
# tkinter是在标准库里面的，实际应用中不推荐使用，可改用wxpython

import xlrd
import xlwt
from tkinter import *
from tkinter.messagebox import showinfo
from tkinter import filedialog
import shelve
import os


#shelve由于使用字节流的处理方式,在索引的过程中需要频繁地转换成字符串,效率奇慢(40秒以上),但后续要使用其数据库功能,故生成一个临时字典代替其索引查找的功能
dic = {}
slowdb = shelve.open("dic-shelve")
for key in slowdb.keys():
	dic[key] = slowdb[key]
slowdb.close()




def writeExcel(province,city,code,row_values,i):
	sheet1.write(i,0,code)
	sheet1.write(i,1,str(row_values(i)[1]))
	sheet1.write(i,2,city)
	sheet1.write(i,3,province)





def wrongJudge(province,city,code,wrongDic,row_values):
	if code == '' or (adressFormat(str(row_values(i)[1])).strip().startswith(province[0:2]) == False and adressFormat(str(row_values(i)[1])).startswith(city[0:2]) == False or len(str(row_values(i)[1])) <= 8):
		wrongDic[str(i)] = {"邮编":code,"所属省份":province,"城市":city,"收件人地址":str(row_values(i)[1])}
		return True

def adressFormat(adress):
	another_adress = adress.strip()
	another_adress = another_adress.replace(" ","")
	another_adress = another_adress.replace("\t","")
	another_adress = another_adress.replace("中国","")
	another_adress = another_adress.replace("，","")
	another_adress = another_adress.replace(",","")
	for i in range(0,32):
		another_adress = another_adress.replace(chr(i),"")
	another_adress = another_adress.replace("\u3000","")

	return another_adress

def saveExcel():
	new_excel.save("done.xls")



def process(adress):
	dicNA = {'N/A': {'所属省份': '', '所辖县级市': [], '邮编': ''}}
	adress_temp = adress
	for province in dic.keys():

		if adress.startswith(province):

			dicNA['N/A']['所属省份'] = province
			adress = adress[len(province):]

			if province.endswith("省") == False and province.endswith("市") == False and (adress.startswith("省") == True or adress.startswith("市") == True):

				adress = adress[1:]

			for city in dic[province]["下辖地级市"].keys():

				if adress.startswith(city):
					code = dic[province]["下辖地级市"][city]["邮编"]
					return province,city,code

				elif province == "北京" or province == "北京市" or province == "上海" or province == "上海市" or province == "天津市" or province == "天津" or province == "重庆市" or province == "重庆":
					code = dic[province]["下辖地级市"][city]["邮编"]
					return province,city,code

				else:
					county_level_cities = dic[province]["下辖地级市"][city]["下辖县级市"]

					for county_level_city in county_level_cities:

						if adress.startswith(county_level_city):

							code = dic[province]["下辖地级市"][city]["邮编"]
							return province,city,code

		else:

			for city in dic[province]["下辖地级市"].keys():

				if adress.startswith(city):

					code = dic[province]["下辖地级市"][city]["邮编"]
					return province,city,code

				for county_level_city in dic[province]["下辖地级市"][city]["下辖县级市"]:

					if adress.startswith(county_level_city):

						code = dic[province]["下辖地级市"][city]["邮编"]
						return province,city,code


		adress = adress_temp

	province,city,code = dicNA['N/A']['所属省份'],"",""

	return province,city,code





root = Tk()
root.withdraw()
excelname = filedialog.askopenfilename()

data = xlrd.open_workbook(excelname) #此处输入文件名，打开需要处理的excel
table = data.sheets()[0] #将excel中的第一个表赋给table对象

nrows = table.nrows #将处理表中的每一行的内容赋给nrows
# print(table.row_values)
new_excel = xlwt.Workbook() #新建另一个excel文档
sheet1 = new_excel.add_sheet('sheet1',cell_overwrite_ok=True) #在新文档中插入一张新表
wrongDic = {}






for i in range(nrows):
	if i == 0:
		#依次填充第0行的四个单元格的内容，其中，write函数的第一个参数为单元格的行标，第二个为列标
		sheet1.write(i,0,'邮编')
		sheet1.write(i,1,'收件人地址')
		sheet1.write(i,2,'城市')
		sheet1.write(i,3,'省份')
		continue

	city_short_name = {'大兴安岭':'地区','和田':'地区','大理':'白族自治州','克孜勒苏柯尔克孜':'自治州','阿勒泰':'地区','文山':'壮族苗族自治州','怒江':'傈僳族自治州','黔东南':'苗族侗族自治州','喀什':'地区','博尔塔拉':'蒙古自治州','塔城':'地区','伊犁哈萨克':'自治州','阿坝':'藏族羌族自治州','红河':'哈尼族彝族自治州','黔西南':'布依族苗族自治州','楚雄':'彝族自治州','德宏':'傣族景颇族自治州','西双版纳':'傣族自治州','临夏':'回族自治州','巴音郭楞':'蒙古自治州','阿克苏':'地区','海西':'蒙古族藏族自治州','凉山':'彝族自治州','昌吉':'回族自治州','甘南':'藏族自治州','黔南':'布依族苗族自治州','迪庆':'藏族自治州','甘孜':'藏族自治州'}
	province,city,code = process(adressFormat(table.row_values(i)[1]))

	if city in city_short_name.keys() :
		city += city_short_name[city]
	elif city not in city_short_name.keys() and city.endswith("市") == False and city != "" and city.endswith("自治州") == False and city.endswith("地区") == False:
		city += "市"
	if province.endswith("省") == False and province.endswith("自治区") == False and province.endswith("市") == False:
		if province == "宁夏":
			province += "回族自治区"
		elif province == "新疆":
			province += "维吾尔族自治区"
		elif province == "广西":
			province += "壮族自治区"
		elif province == "西藏" or province == "内蒙古":
			province += "自治区"

		elif province == "北京":
			province += "市"
		elif province == "上海":
			province += "市"
		elif province == "天津":
			province += "市"
		elif province == "重庆":
			province += "市"
		elif province == "":
			province = ""
		else:
			province += "省"

	writeExcel(province,city,code,table.row_values,i)
	wrongJudge(province,city,code,wrongDic,table.row_values)

new_excel.save("done.xls")

wrongDic_keylist = []
for key in wrongDic:
	wrongDic_keylist.append(key)
b = len(wrongDic_keylist) - 1

c = 0













# GUI






fieldnames = ('收件人地址','邮编','城市','所属省份')
fieldnames2 = ('省份','省份所辖地级市','地级市所辖县级市','地级市邮编')
fieldnames3 = ('数据库省份','数据库地级市','数据库县级市','数据库邮编')



def set_default_shelve():
	os.remove("dic-shelve.db")
	os.remove("extra_dic.txt")
	db = shelve.open("dic-shelve")
	for key in dic.keys():
		db[key] = dic[key]
	db.close()



def delete_extra_province():
	province_value = entries["数据库省份"].get()
	city_value = entries["数据库地级市"].get()
	county_level_city_value = entries["数据库县级市"].get()
	code_value = entries["数据库邮编"].get()
	try:
		file = open("extra_dic.txt")
	except Exception:
		showinfo(title="",message="额外字典尚未创建")
		return
	else:
		pass
	finally:
		pass

	fileline_list = []

	for line in file.readlines():
		fileline_list.append(line.strip())
	file.close()


	for line in fileline_list:
		if province_value == line.strip().split("\t")[0]:
			db = shelve.open("dic-shelve",writeback=True)
			dbtemp = db
			dbtemp.pop(province_value)
			db = dbtemp
			db.close()
			# print(line)
			# print(fileline_list)
			fileline_list.remove(line)
			# print(fileline_list)
			file = open("extra_dic.txt","w+")
			for line in fileline_list:
				file.write(line + "\n")
			file.close()
			showinfo(title="",message="删除成功")
			return True
	showinfo(title="",message="额外字典文件中无此项")


def extra_item():
	global c
	try:
		extra_dic = open("extra_dic.txt")
	except FileNotFoundError:
		showinfo(title="",message="额外字典尚未创建")
		return
	else:
		pass
	finally:
		pass

	extra_dic_keylist = []
	for line in extra_dic.readlines():
		extra_dic_keylist.append(line.strip())

	c = len(extra_dic_keylist) - 1

	global key2
	if c < 0 :
		c = len(extra_dic_keylist) - 1
	if extra_dic_keylist == []:
		showinfo(title="",message="额外字典为空")
		return
	key2 = extra_dic_keylist[c].split("\t")
	c -= 1
	for item in fieldnames3:
			entries[item].delete(0,END)
	entries["数据库省份"].insert(0,key2[0])
	entries["数据库地级市"].insert(0,key2[1])
	entries["数据库县级市"].insert(0,key2[2])
	entries["数据库邮编"].insert(0,key2[3])
	extra_dic.close()


def fetchWrong():
	global b
	global key
	if b < 0 :
		b = len(wrongDic_keylist) - 1
	key = wrongDic_keylist[b]
	b -= 1
	try:
		entries["行数"].delete(0,END)
		entries["行数"].insert(0,key)
	except:
		pass
	else:
		for item in fieldnames:
			entries[item].delete(0,END)
			entries[item].insert(0,wrongDic[key][item])

def update():
	wrongDic[key]["邮编"] = entries["邮编"].get()
	wrongDic[key]["城市"] = entries["城市"].get()
	wrongDic[key]["所属省份"] = entries["所属省份"].get()
	if entries["收件人地址"].get() == "":
		showinfo(title="",message="未获取出错数据!请先获取一个出错行")
		return
	m = key
	for v in fieldnames:
		if v == "收件人地址":
			pass
		else:
			if wrongDic[key][v] == "":
				showinfo(title="",message= v + "字段不能为空!")
				return
	writeExcel(wrongDic[m]["所属省份"],wrongDic[m]["城市"],wrongDic[m]["邮编"],table.row_values,int(m))
	showinfo(title="",message="已更新到Excel")
	saveExcel()

def append_to_dic():
	extra_dic = open("extra_dic.txt","a")
	for item in fieldnames2:
		if entries[item].get() == "":
			showinfo(title="出错",message=item + "字段不能为空!")
			return
	extra_province = entries["省份"].get()
	extra_city = entries["省份所辖地级市"].get()
	extra_county_level_city = entries["地级市所辖县级市"].get()
	extra_code = entries["地级市邮编"].get()

	db = shelve.open("dic-shelve",writeback=True)

	if extra_province in db.keys():

		if extra_city in db[extra_province]["下辖地级市"].keys():
			if extra_county_level_city in db[extra_province]["下辖地级市"][extra_city]["下辖县级市"]:
					showinfo(title="条目已存在",message="条目已存在")
			else:

				list1 = db[extra_province]["下辖地级市"][extra_city]["下辖县级市"]
				list1.append(str(extra_county_level_city))
				db[extra_province]["下辖地级市"][extra_city]["下辖县级市"] = list1
				extra_dic.write(extra_province + "\t" + extra_city + "\t" + extra_county_level_city + "\t" + extra_code + "\n")
				showinfo(title="添加完成",message="添加完成")


		else:
			db[extra_province]["下辖地级市"][extra_city] = {}
			db[extra_province]["下辖地级市"][extra_city] = {"下辖县级市":extra_county_level_city,"邮编":extra_code}
			extra_dic.write(extra_province + "\t" + extra_city + "\t" + extra_county_level_city + "\t" + extra_code + "\n")
			# print(db["123"])
			showinfo(title="添加完成",message="添加完成")

	else:
		db[extra_province] = {"下辖地级市":{extra_city:{"下辖县级市":extra_county_level_city.split(","),"邮编":extra_code}}}
		extra_dic.write(extra_province + "\t" + extra_city + "\t" + extra_county_level_city + "\t" + extra_code + "\n")
		showinfo(title="添加完成",message="添加完成")

	db.close()
	extra_dic.close()

fieldnames = ('收件人地址','邮编','城市','所属省份')
fieldnames2 = ('省份','省份所辖地级市','地级市所辖县级市','地级市邮编')
fieldnames3 = ('数据库省份','数据库地级市','数据库县级市','数据库邮编')


def makeWidgets():

	global entries
	window = Tk()
	# window.withdraw()
	# fpath = filedialog.askopenfilename()
	window.title('修正')
	Label(window,text='\n\n表单出错数据\n\n').grid(row=0,column=6)
	entries = {}

	for (ix,label) in enumerate(('行数',) + fieldnames):
		lab = Label(window,text=label,justify=RIGHT)
		ent = Entry(window)
		lab.grid(row=ix+1,column=5,sticky=E)
		ent.grid(row=ix+1,column=6)
		entries[label] = ent

	Label(window,text="\n\n新增条目到字典\n\n").grid(row=8,column=6)

	for (ix,label) in enumerate(fieldnames2):
		lab = Label(window,text=label)
		ent = Entry(window)
		lab.grid(row=ix+9,column=5,sticky=E)
		ent.grid(row=ix+9,column=6)
		entries[label] = ent

	Label(window,text="\n\n删除额外字典中的条目\n\n").grid(row=15,column=6)

	for (ix,label) in enumerate(fieldnames3):
		lab = Label(window,text=label)
		ent = Entry(window)
		lab.grid(row=ix+16,column=5,sticky=E)
		ent.grid(row=ix+16,column=6)
		entries[label] = ent


	# Label(window,text="\n").pack(side=TOP)




	Button(window,text='获取下一个出错行',command=fetchWrong).grid(row=7,column=5)
	Button(window,text='当前条目更新到Excel',command=update).grid(row=7,column=6)



	# button4 = Button(window,text='退出',command=window.quit)
	Button(window,text='添加到额外字典',command=append_to_dic).grid(row=13,column=6)
	Button(window,text='浏览下一个额外字典项',command=extra_item).grid(row=20,column=5)
	Button(window,text='重置默认数据库',command=set_default_shelve).grid(row=17,column=30)
	Button(window,text='删除整个字典项',command=delete_extra_province).grid(row=20,column=6)
	Label(window,text="\n\n\n\n").grid(row=21,column=6)

	# photo = PhotoImage(file='1.gif')
	# labelpic = Label(image=photo)
	# labelpic.image = photo
	# labelpic.grid(row=0,column=20,columnspan=20,rowspan=20)
	return window

default_dic = {
			 '广西': {'下辖地级市':
						 {'贵港': {'下辖县级市':
									 ['桂平市', '桂平'],
										 '邮编': '537000'},
						 '桂林': {'下辖县级市':
									 [],
										 '邮编': '541000'},
						 '南宁市': {'下辖县级市':
									 [],
										 '邮编': '530000'},
						 '防城港': {'下辖县级市':
									 ['东兴', '东兴市'],
										 '邮编': '538000'},
						 '来宾市': {'下辖县级市':
									 ['合山市', '合山'],
										 '邮编': '546100'},
						 '贵港市': {'下辖县级市':
									 ['桂平市', '桂平'],
										 '邮编': '537000'},
						 '贺州': {'下辖县级市':
									 [],
										 '邮编': '542800'},
						 '崇左市': {'下辖县级市':
									 ['凭祥市', '凭祥'],
										 '邮编': '532200'},
						 '百色': {'下辖县级市':
									 ['靖西市', '靖西'],
										 '邮编': '533000'},
						 '柳州市': {'下辖县级市':
									 [],
										 '邮编': '545000'},
						 '南宁': {'下辖县级市':
									 [],
										 '邮编': '530000'},
						 '梧州市': {'下辖县级市':
									 ['岑溪市', '岑溪'],
										 '邮编': '543000'},
						 '崇左': {'下辖县级市':
									 ['凭祥市', '凭祥'],
										 '邮编': '532200'},
						 '桂林市': {'下辖县级市':
									 [],
										 '邮编': '541000'},
						 '北海市': {'下辖县级市':
									 [],
										 '邮编': '536000'},
						 '柳州': {'下辖县级市':
									 [],
										 '邮编': '545000'},
						 '钦州市': {'下辖县级市':
									 [],
										 '邮编': '535000'},
						 '钦州': {'下辖县级市':
									 [],
										 '邮编': '535000'},
						 '河池': {'下辖县级市':
									 [],
										 '邮编': '547000'},
						 '玉林市': {'下辖县级市':
									 ['北流', '北流市'],
										 '邮编': '537000'},
						 '河池市': {'下辖县级市':
									 [],
										 '邮编': '547000'},
						 '贺州市': {'下辖县级市':
									 [],
										 '邮编': '542800'},
						 '北海': {'下辖县级市':
									 [],
										 '邮编': '536000'},
						 '来宾': {'下辖县级市':
									 ['合山市', '合山'],
										 '邮编': '546100'},
						 '梧州': {'下辖县级市':
									 ['岑溪市', '岑溪'],
										 '邮编': '543000'},
						 '玉林': {'下辖县级市':
									 ['北流', '北流市'],
										 '邮编': '537000'},
						 '百色市': {'下辖县级市':
									 ['靖西', '靖西市'],
										 '邮编': '533000'},
						 '防城港市': {'下辖县级市':
									 ['东兴', '东兴市'],
										 '邮编': '538000'}}},
			 '天津市': {'下辖地级市':
						 {'天津市': {'下辖县级市':
									 ['天津市', '天津'],
										 '邮编': '300000'},
						 '天津': {'下辖县级市':
									 ['天津市', '天津'],
										 '邮编': '300000'}}},
			 '广东': {'下辖地级市':
						 {'茂名市': {'下辖县级市':
									 ['高州市', '信宜', '高州', '信宜市', '化州市', '化州'],
										 '邮编': '525000'},
						 '云浮': {'下辖县级市':
									 ['罗定', '罗定市'],
										 '邮编': '527300'},
						 '韶关': {'下辖县级市':
									 ['乐昌', '乐昌市', '南雄市', '南雄'],
										 '邮编': '512000'},
						 '云浮市': {'下辖县级市':
									 ['罗定市', '罗定'],
										 '邮编': '527300'},
						 '佛山市': {'下辖县级市':
									 [],
										 '邮编': '528000'},
						 '揭阳市': {'下辖县级市':
									 ['普宁市', '普宁'],
										 '邮编': '522000'},
						 '河源市': {'下辖县级市':
									 [],
										 '邮编': '517000'},
						 '清远': {'下辖县级市':
									 ['英德', '英德市', '连州市', '连州'],
										 '邮编': '511500'},
						 '潮州': {'下辖县级市':
									 [],
										 '邮编': '521000'},
						 '韶关市': {'下辖县级市':
									 ['乐昌', '乐昌市', '南雄市', '南雄'],
										 '邮编': '512000'},
						 '珠海市': {'下辖县级市':
									 [],
										 '邮编': '519000'},
						 '梅州市': {'下辖县级市':
									 ['兴宁市', '兴宁'],
										 '邮编': '514000'},
						 '东莞市': {'下辖县级市':
									 [],
										 '邮编': '523000'},
						 '珠海': {'下辖县级市':
									 [],
										 '邮编': '519000'},
						 '广州': {'下辖县级市':
									 [],
										 '邮编': '510000'},
						 '惠州市': {'下辖县级市':
									 [],
										 '邮编': '516000'},
						 '汕尾市': {'下辖县级市':
									 ['陆丰', '陆丰市'],
										 '邮编': '516600'},
						 '深圳市': {'下辖县级市':
									 [],
										 '邮编': '518000'},
						 '汕头市': {'下辖县级市':
									 [],
										 '邮编': '515000'},
						 '梅州': {'下辖县级市':
									 ['兴宁市', '兴宁'],
										 '邮编': '514000'},
						 '江门': {'下辖县级市':
									 ['台山', '恩平', '台山市', '恩平市', '鹤山市', '鹤山', '开平市', '开平'],
										 '邮编': '529000'},
						 '揭阳': {'下辖县级市':
									 ['普宁市', '普宁'],
										 '邮编': '522000'},
						 '茂名': {'下辖县级市':
									 ['高州市', '信宜', '信宜市', '高州', '化州市', '化州'],
										 '邮编': '525000'},
						 '汕头': {'下辖县级市':
									 [],
										 '邮编': '515000'},
						 '广州市': {'下辖县级市':
									 [],
										 '邮编': '510000'},
						 '惠州': {'下辖县级市':
									 [],
										 '邮编': '516000'},
						 '中山': {'下辖县级市':
									 [],
										 '邮编': '528400'},
						 '潮州市': {'下辖县级市':
									 [],
										 '邮编': '521000'},
						 '阳江市': {'下辖县级市':
									 ['阳春市', '阳春'],
										 '邮编': '529500'},
						 '肇庆市': {'下辖县级市':
									 ['四会', '四会市'],
										 '邮编': '526000'},
						 '湛江': {'下辖县级市':
									 ['廉江市', '雷州', '廉江', '雷州市', '吴川', '吴川市'],
										 '邮编': '524000'},
						 '清远市': {'下辖县级市':
									 ['英德', '连州市', '英德市', '连州'],
										 '邮编': '511500'},
						 '河源': {'下辖县级市':
									 [],
										 '邮编': '517000'},
						 '中山市': {'下辖县级市':
									 [],
										 '邮编': '528400'},
						 '阳江': {'下辖县级市':
									 ['阳春市', '阳春'],
										 '邮编': '529500'},
						 '佛山': {'下辖县级市':
									 [],
										 '邮编': '528000'},
						 '江门市': {'下辖县级市':
									 ['台山', '恩平', '台山市', '恩平市', '鹤山市', '鹤山', '开平市', '开平'],
										 '邮编': '529000'},
						 '东莞': {'下辖县级市':
									 [],
										 '邮编': '523000'},
						 '肇庆': {'下辖县级市':
									 ['四会', '四会市'],
										 '邮编': '526000'},
						 '湛江市': {'下辖县级市':
									 ['廉江市', '廉江', '雷州', '雷州市', '吴川', '吴川市'],
										 '邮编': '524000'},
						 '汕尾': {'下辖县级市':
									 ['陆丰', '陆丰市'],
										 '邮编': '516600'},
						 '深圳': {'下辖县级市':
									 [],
										 '邮编': '518000'}}},
			 '海南省': {'下辖地级市':
						 {'儋州': {'下辖县级市':
									 [],
										 '邮编': '571700'},
						 '儋州市': {'下辖县级市':
									 [],
										 '邮编': '571700'},
						 '三亚市': {'下辖县级市':
									 [],
										 '邮编': '572000'},
						 '三亚': {'下辖县级市':
									 [],
										 '邮编': '572000'},
						 '三沙市': {'下辖县级市':
									 [],
										 '邮编': '573199'},
						 '海口市': {'下辖县级市':
									 [],
										 '邮编': '570100'},
						 '海口': {'下辖县级市':
									 [],
										 '邮编': '570100'},
						 '三沙': {'下辖县级市':
									 [],
										 '邮编': '573199'}}},
			 '山东': {'下辖地级市':
						 {'德州市': {'下辖县级市':
									 ['禹城市', '乐陵', '禹城', '乐陵市'],
										 '邮编': '253000'},
						 '日照市': {'下辖县级市':
									 [],
										 '邮编': '276800'},
						 '泰安': {'下辖县级市':
									 ['肥城', '肥城市', '新泰市', '新泰'],
										 '邮编': '271000'},
						 '菏泽市': {'下辖县级市':
									 [],
										 '邮编': '274000'},
						 '威海市': {'下辖县级市':
									 ['荣成市', '乳山', '乳山市', '荣成'],
										 '邮编': '264200'},
						 '莱芜': {'下辖县级市':
									 [],
										 '邮编': '271100'},
						 '烟台市': {'下辖县级市':
									 ['招远', '莱阳市', '栖霞', '海阳', '招远市', '龙口市', '海阳市', '栖霞市', '莱阳', '莱州', '龙口', '蓬莱', '莱州市', '蓬莱市'],
										 '邮编': '264000'},
						 '菏泽': {'下辖县级市':
									 [],
										 '邮编': '274000'},
						 '青岛': {'下辖县级市':
									 ['平度市', '莱西', '平度', '胶州', '莱西市', '胶州市', '即墨市', '即墨'],
										 '邮编': '266000'},
						 '济宁市': {'下辖县级市':
									 ['邹城市', '曲阜', '邹城', '曲阜市'],
										 '邮编': '272000'},
						 '东营': {'下辖县级市':
									 [],
										 '邮编': '257000'},
						 '青岛市': {'下辖县级市':
									 ['平度市', '莱西', '平度', '胶州', '莱西市', '胶州市', '即墨市', '即墨'],
										 '邮编': '266000'},
						 '东营市': {'下辖县级市':
									 [],
										 '邮编': '257000'},
						 '潍坊市': {'下辖县级市':
									 ['青州市', '安丘市', '高密', '诸城市', '高密市', '青州', '昌邑市', '昌邑', '寿光市', '安丘', '寿光', '诸城'],
										 '邮编': '261000'},
						 '临沂市': {'下辖县级市':
									 [],
										 '邮编': '276000'},
						 '烟台': {'下辖县级市':
									 ['招远', '栖霞', '海阳', '莱阳市', '招远市', '龙口市', '海阳市', '栖霞市', '莱阳', '莱州', '龙口', '蓬莱', '莱州市', '蓬莱市'],
										 '邮编': '264000'},
						 '枣庄': {'下辖县级市':
									 ['滕州', '滕州市'],
										 '邮编': '277000'},
						 '淄博市': {'下辖县级市':
									 [],
										 '邮编': '255000'},
						 '威海': {'下辖县级市':
									 ['荣成市', '乳山', '乳山市', '荣成'],
										 '邮编': '264200'},
						 '济南': {'下辖县级市':
									 [],
										 '邮编': '250000'},
						 '德州': {'下辖县级市':
									 ['乐陵市', '禹城市', '乐陵', '禹城'],
										 '邮编': '253000'},
						 '莱芜市': {'下辖县级市':
									 [],
										 '邮编': '271100'},
						 '临沂': {'下辖县级市':
									 [],
										 '邮编': '276000'},
						 '滨州': {'下辖县级市':
									 [],
										 '邮编': '256600'},
						 '聊城市': {'下辖县级市':
									 ['临清市', '临清'],
										 '邮编': '252000'},
						 '济宁': {'下辖县级市':
									 ['邹城市', '曲阜', '邹城', '曲阜市'],
										 '邮编': '272000'},
						 '淄博': {'下辖县级市':
									 [],
										 '邮编': '255000'},
						 '泰安市': {'下辖县级市':
									 ['肥城', '肥城市', '新泰市', '新泰'],
										 '邮编': '271000'},
						 '日照': {'下辖县级市':
									 [],
										 '邮编': '276800'},
						 '聊城': {'下辖县级市':
									 ['临清市', '临清'],
										 '邮编': '252000'},
						 '济南市': {'下辖县级市':
									 [],
										 '邮编': '250000'},
						 '滨州市': {'下辖县级市':
									 [],
										 '邮编': '256600'},
						 '潍坊': {'下辖县级市':
									 ['青州市', '安丘市', '高密', '诸城市', '青州', '昌邑', '高密市', '昌邑市', '寿光市', '安丘', '寿光', '诸城'],
										 '邮编': '261000'},
						 '枣庄市': {'下辖县级市':
									 ['滕州', '滕州市'],
										 '邮编': '277000'}}},
			 '青海': {'下辖地级市':
						 {'西宁': {'下辖县级市':
									 [],
										 '邮编': '810000'},
						 '海西蒙古族藏族自治州': {'下辖县级市':
										 ['德令哈市','格尔木市','德令哈','格尔木'],
											 '邮编':'817000'},
						 '海西': {'下辖县级市':
										 ['德令哈市','格尔木市','德令哈','格尔木'],
											 '邮编':'817000'},
						 '西宁市': {'下辖县级市':
									 [],
										 '邮编': '810000'},
						 '海东市': {'下辖县级市':
									 [],
										 '邮编': '810699'},
						 '海东': {'下辖县级市':
									 [],
										 '邮编': '810699'}}},
			 '浙江': {'下辖地级市':
						 {'舟山': {'下辖县级市':
									 [],
										 '邮编': '316000'},
						 '嘉兴市': {'下辖县级市':
									 ['桐乡', '海宁市', '平湖市', '桐乡市', '海宁', '平湖'],
										 '邮编': '314000'},
						 '衢州市': {'下辖县级市':
									 ['江山', '江山市'],
										 '邮编': '324000'},
						 '丽水': {'下辖县级市':
									 ['龙泉市', '龙泉'],
										 '邮编': '323000'},
						 '台州': {'下辖县级市':
									 ['温岭', '温岭市', '玉环', '临海市', '玉环市', '临海'],
										 '邮编': '318000'},
						 '绍兴市': {'下辖县级市':
									 ['诸暨', '诸暨市', '嵊州', '嵊州市'],
										 '邮编': '312000'},
						 '嘉兴': {'下辖县级市':
									 ['桐乡', '海宁市', '平湖市', '桐乡市', '海宁', '平湖'],
										 '邮编': '314000'},
						 '舟山市': {'下辖县级市':
									 [],
										 '邮编': '316000'},
						 '杭州': {'下辖县级市':
									 ['建德市', '建德', '临安市', '临安'],
										 '邮编': '310000'},
						 '湖州市': {'下辖县级市':
									 [],
										 '邮编': '313000'},
						 '金华市': {'下辖县级市':
									 ['永康市', '兰溪市', '永康', '兰溪', '东阳', '东阳市', '义乌', '义乌市'],
										 '邮编': '321000'},
						 '金华': {'下辖县级市':
									 ['永康市', '兰溪市', '永康', '兰溪', '东阳', '东阳市', '义乌', '义乌市'],
										 '邮编': '321000'},
						 '丽水市': {'下辖县级市':
									 ['龙泉市', '龙泉'],
										 '邮编': '323000'},
						 '衢州': {'下辖县级市':
									 ['江山', '江山市'],
										 '邮编': '324000'},
						 '杭州市': {'下辖县级市':
									 ['建德市', '建德', '临安市', '临安'],
										 '邮编': '310000'},
						 '台州市': {'下辖县级市':
									 ['温岭', '温岭市', '玉环', '临海市', '临海', '玉环市'],
										 '邮编': '318000'},
						 '宁波': {'下辖县级市':
									 ['慈溪', '余姚', '余姚市', '慈溪市'],
										 '邮编': '315000'},
						 '湖州': {'下辖县级市':
									 [],
										 '邮编': '313000'},
						 '宁波市': {'下辖县级市':
									 ['慈溪', '余姚', '余姚市', '慈溪市'],
										 '邮编': '315000'},
						 '温州': {'下辖县级市':
									 ['乐清市', '瑞安', '瑞安市', '乐清'],
										 '邮编': '325000'},
						 '绍兴': {'下辖县级市':
									 ['诸暨', '诸暨市', '嵊州', '嵊州市'],
										 '邮编': '312000'},
						 '温州市': {'下辖县级市':
									 ['瑞安', '乐清市', '瑞安市', '乐清'],
										 '邮编': '325000'}}},
			 '山东省': {'下辖地级市':
						 {'德州市': {'下辖县级市':
									 ['禹城市', '乐陵', '禹城', '乐陵市'],
										 '邮编': '253000'},
						 '日照市': {'下辖县级市':
									 [],
										 '邮编': '276800'},
						 '泰安': {'下辖县级市':
									 ['肥城', '肥城市', '新泰市', '新泰'],
										 '邮编': '271000'},
						 '菏泽市': {'下辖县级市':
									 [],
										 '邮编': '274000'},
						 '威海市': {'下辖县级市':
									 ['荣成市', '乳山', '乳山市', '荣成'],
										 '邮编': '264200'},
						 '聊城': {'下辖县级市':
									 ['临清市', '临清'],
										 '邮编': '252000'},
						 '烟台市': {'下辖县级市':
									 ['招远', '莱阳市', '栖霞', '海阳', '招远市', '龙口市', '海阳市', '栖霞市', '莱阳', '莱州', '龙口', '蓬莱', '莱州市', '蓬莱市'],
										 '邮编': '264000'},
						 '菏泽': {'下辖县级市':
									 [],
										 '邮编': '274000'},
						 '青岛': {'下辖县级市':
									 ['平度市', '莱西', '平度', '胶州', '莱西市', '胶州市', '即墨市', '即墨'],
										 '邮编': '266000'},
						 '济宁市': {'下辖县级市':
									 ['邹城市', '曲阜', '邹城', '曲阜市'],
										 '邮编': '272000'},
						 '东营': {'下辖县级市':
									 [],
										 '邮编': '257000'},
						 '东营市': {'下辖县级市':
									 [],
										 '邮编': '257000'},
						 '潍坊市': {'下辖县级市':
									 ['青州市', '安丘市', '高密', '诸城市', '高密市', '青州', '昌邑市', '昌邑', '寿光市', '安丘', '寿光', '诸城'],
										 '邮编': '261000'},
						 '青岛市': {'下辖县级市':
									 ['平度市', '莱西', '平度', '胶州', '莱西市', '胶州市', '即墨市', '即墨'],
										 '邮编': '266000'},
						 '烟台': {'下辖县级市':
									 ['招远', '栖霞', '海阳', '莱阳市', '招远市', '龙口市', '海阳市', '栖霞市', '莱阳', '莱州', '龙口', '蓬莱', '莱州市', '蓬莱市'],
										 '邮编': '264000'},
						 '临沂市': {'下辖县级市':
									 [],
										 '邮编': '276000'},
						 '淄博市': {'下辖县级市':
									 [],
										 '邮编': '255000'},
						 '威海': {'下辖县级市':
									 ['荣成市', '乳山', '乳山市', '荣成'],
										 '邮编': '264200'},
						 '济南': {'下辖县级市':
									 [],
										 '邮编': '250000'},
						 '德州': {'下辖县级市':
									 ['乐陵市', '禹城市', '乐陵', '禹城'],
										 '邮编': '253000'},
						 '莱芜市': {'下辖县级市':
									 [],
										 '邮编': '271100'},
						 '临沂': {'下辖县级市':
									 [],
										 '邮编': '276000'},
						 '滨州': {'下辖县级市':
									 [],
										 '邮编': '256600'},
						 '聊城市': {'下辖县级市':
									 ['临清市', '临清'],
										 '邮编': '252000'},
						 '济宁': {'下辖县级市':
									 ['邹城市', '曲阜', '邹城', '曲阜市'],
										 '邮编': '272000'},
						 '枣庄': {'下辖县级市':
									 ['滕州', '滕州市'],
										 '邮编': '277000'},
						 '淄博': {'下辖县级市':
									 [],
										 '邮编': '255000'},
						 '泰安市': {'下辖县级市':
									 ['肥城', '肥城市', '新泰市', '新泰'],
										 '邮编': '271000'},
						 '日照': {'下辖县级市':
									 [],
										 '邮编': '276800'},
						 '莱芜': {'下辖县级市':
									 [],
										 '邮编': '271100'},
						 '济南市': {'下辖县级市':
									 [],
										 '邮编': '250000'},
						 '滨州市': {'下辖县级市':
									 [],
										 '邮编': '256600'},
						 '潍坊': {'下辖县级市':
									 ['青州市', '安丘市', '高密', '诸城市', '青州', '昌邑', '高密市', '昌邑市', '寿光市', '安丘', '寿光', '诸城'],
										 '邮编': '261000'},
						 '枣庄市': {'下辖县级市':
									 ['滕州', '滕州市'],
										 '邮编': '277000'}}},
			 '江西省': {'下辖地级市':
						 {'九江市': {'下辖县级市':
									 ['共青城', '庐山市', '瑞昌', '共青城市', '庐山', '瑞昌市'],
										 '邮编': '332000'},
						 '鹰潭市': {'下辖县级市':
									 ['贵溪', '贵溪市'],
										 '邮编': '335000'},
						 '抚州': {'下辖县级市':
									 [],
										 '邮编': '344000'},
						 '抚州市': {'下辖县级市':
									 [],
										 '邮编': '344000'},
						 '南昌市': {'下辖县级市':
									 [],
										 '邮编': '330000'},
						 '九江': {'下辖县级市':
									 ['共青城', '庐山市', '庐山', '瑞昌', '共青城市', '瑞昌市'],
										 '邮编': '332000'},
						 '宜春市': {'下辖县级市':
									 ['樟树', '丰城', '高安', '丰城市', '樟树市', '高安市'],
										 '邮编': '336000'},
						 '新余市': {'下辖县级市':
									 [],
										 '邮编': '336500'},
						 '吉安': {'下辖县级市':
									 ['井冈山', '井冈山市'],
										 '邮编': '343000'},
						 '景德镇': {'下辖县级市':
									 ['乐平', '乐平市'],
										 '邮编': '333000'},
						 '吉安市': {'下辖县级市':
									 ['井冈山', '井冈山市'],
										 '邮编': '343000'},
						 '宜春': {'下辖县级市':
									 ['樟树', '丰城', '高安', '丰城市', '樟树市', '高安市'],
										 '邮编': '336000'},
						 '景德镇市': {'下辖县级市':
									 ['乐平', '乐平市'],
										 '邮编': '333000'},
						 '萍乡市': {'下辖县级市':
									 [],
										 '邮编': '337000'},
						 '萍乡': {'下辖县级市':
									 [],
										 '邮编': '337000'},
						 '上饶市': {'下辖县级市':
									 ['德兴', '德兴市'],
										 '邮编': '334000'},
						 '赣州': {'下辖县级市':
									 ['瑞金', '瑞金市'],
										 '邮编': '341000'},
						 '新余': {'下辖县级市':
									 [],
										 '邮编': '336500'},
						 '赣州市': {'下辖县级市':
									 ['瑞金', '瑞金市'],
										 '邮编': '341000'},
						 '上饶': {'下辖县级市':
									 ['德兴', '德兴市'],
										 '邮编': '334000'},
						 '鹰潭': {'下辖县级市':
									 ['贵溪', '贵溪市'],
										 '邮编': '335000'},
						 '南昌': {'下辖县级市':
									 [],
										 '邮编': '330000'}}},
			 '山西省': {'下辖地级市':
						 {'大同': {'下辖县级市':
									 [],
										 '邮编': '037000'},
						 '晋中市': {'下辖县级市':
									 ['介休市', '介休'],
										 '邮编': '038300'},
						 '晋城': {'下辖县级市':
									 ['高平市', '高平'],
										 '邮编': '048000'},
						 '临汾': {'下辖县级市':
									 ['霍州', '侯马市', '霍州市', '侯马'],
										 '邮编': '041000'},
						 '忻州': {'下辖县级市':
									 ['原平市', '原平'],
										 '邮编': '034000'},
						 '朔州市': {'下辖县级市':
									 [],
										 '邮编': '038500'},
						 '忻州市': {'下辖县级市':
									 ['原平市', '原平'],
										 '邮编': '034000'},
						 '太原市': {'下辖县级市':
									 ['古交市', '古交'],
										 '邮编': '030000'},
						 '运城市': {'下辖县级市':
									 ['永济', '河津', '永济市', '河津市'],
										 '邮编': '044000'},
						 '长治': {'下辖县级市':
									 ['潞城市', '潞城'],
										 '邮编': '046000'},
						 '太原': {'下辖县级市':
									 ['古交市', '古交'],
										 '邮编': '030000'},
						 '晋中': {'下辖县级市':
									 ['介休市', '介休'],
										 '邮编': '038300'},
						 '长治市': {'下辖县级市':
									 ['潞城市', '潞城'],
										 '邮编': '046000'},
						 '阳泉': {'下辖县级市':
									 [],
										 '邮编': '045000'},
						 '朔州': {'下辖县级市':
									 [],
										 '邮编': '038500'},
						 '大同市': {'下辖县级市':
									 [],
										 '邮编': '037000'},
						 '吕梁': {'下辖县级市':
									 ['汾阳市', '孝义市', '孝义', '汾阳'],
										 '邮编': '033000'},
						 '临汾市': {'下辖县级市':
									 ['霍州', '侯马市', '霍州市', '侯马'],
										 '邮编': '041000'},
						 '晋城市': {'下辖县级市':
									 ['高平市', '高平'],
										 '邮编': '048000'},
						 '吕梁市': {'下辖县级市':
									 ['汾阳市', '孝义', '孝义市', '汾阳'],
										 '邮编': '033000'},
						 '运城': {'下辖县级市':
									 ['永济', '河津', '永济市', '河津市'],
										 '邮编': '044000'},
						 '阳泉市': {'下辖县级市':
									 [],
										 '邮编': '045000'}}},
			 '黑龙江省': {'下辖地级市':
						 {'鹤岗市': {'下辖县级市':
									 [],
										 '邮编': '154100'},
						 '伊春市': {'下辖县级市':
									 ['铁力市', '铁力'],
										 '邮编': '153000'},
						 '大兴安岭地区': {'下辖县级市':
									 [],
										 '邮编': '165000'},
						 '大兴安岭': {'下辖县级市':
									 [],
										 '邮编': '165000'},
						 '鸡西': {'下辖县级市':
									 ['密山市', '虎林', '密山', '虎林市'],
										 '邮编': '158100'},
						 '鸡西市': {'下辖县级市':
									 ['虎林市', '密山市', '密山', '虎林'],
										 '邮编': '158100'},
						 '哈尔滨': {'下辖县级市':
									 ['尚志市', '五常', '尚志', '五常市'],
										 '邮编': '150000'},
						 '佳木斯': {'下辖县级市':
									 ['同江市', '同江', '抚远', '富锦市', '抚远市', '富锦'],
										 '邮编': '154000'},
						 '黑河市': {'下辖县级市':
									 ['五大连池', '五大连池市', '北安市', '北安'],
										 '邮编': '164300'},
						 '齐齐哈尔': {'下辖县级市':
									 ['讷河', '讷河市'],
										 '邮编': '161000'},
						 '双鸭山': {'下辖县级市':
									 [],
										 '邮编': '155100'},
						 '双鸭山市': {'下辖县级市':
									 [],
										 '邮编': '155100'},
						 '黑河': {'下辖县级市':
									 ['五大连池', '五大连池市', '北安市', '北安'],
										 '邮编': '164300'},
						 '牡丹江': {'下辖县级市':
									 ['东宁', '海林', '穆棱', '宁安市', '海林市', '宁安', '东宁市', '穆棱市', '绥芬河市', '绥芬河'],
										 '邮编': '157000'},
						 '齐齐哈尔市': {'下辖县级市':
									 ['讷河', '讷河市'],
										 '邮编': '161000'},
						 '绥化': {'下辖县级市':
									 ['肇东', '海伦市', '安达', '海伦', '肇东市', '安达市'],
										 '邮编': '152000'},
						 '七台河': {'下辖县级市':
									 [],
										 '邮编': '154600'},
						 '七台河市': {'下辖县级市':
									 [],
										 '邮编': '154600'},
						 '鹤岗': {'下辖县级市':
									 [],
										 '邮编': '154100'},
						 '伊春': {'下辖县级市':
									 ['铁力市', '铁力'],
										 '邮编': '153000'},
						 '哈尔滨市': {'下辖县级市':
									 ['尚志市', '尚志', '五常', '五常市'],
										 '邮编': '150000'},
						 '佳木斯市': {'下辖县级市':
									 ['同江市', '同江', '抚远', '富锦市', '抚远市', '富锦'],
										 '邮编': '154000'},
						 '牡丹江市': {'下辖县级市':
									 ['东宁', '海林', '穆棱', '宁安市', '海林市', '东宁市', '宁安', '穆棱市', '绥芬河市', '绥芬河'],
										 '邮编': '157000'},
						 '绥化市': {'下辖县级市':
									 ['肇东', '海伦市', '安达', '海伦', '肇东市', '安达市'],
										 '邮编': '152000'},
						 '大庆市': {'下辖县级市':
									 [],
										 '邮编': '163000'},
						 '大庆': {'下辖县级市':
									 [],
										 '邮编': '163000'}}},
			 '江西': {'下辖地级市':
						 {'九江市': {'下辖县级市':
									 ['共青城', '庐山市', '瑞昌', '共青城市', '庐山', '瑞昌市'],
										 '邮编': '332000'},
						 '鹰潭市': {'下辖县级市':
									 ['贵溪', '贵溪市'],
										 '邮编': '335000'},
						 '抚州': {'下辖县级市':
									 [],
										 '邮编': '344000'},
						 '新余市': {'下辖县级市':
									 [],
										 '邮编': '336500'},
						 '上饶': {'下辖县级市':
									 ['德兴', '德兴市'],
										 '邮编': '334000'},
						 '九江': {'下辖县级市':
									 ['共青城', '庐山市', '庐山', '瑞昌', '共青城市', '瑞昌市'],
										 '邮编': '332000'},
						 '南昌': {'下辖县级市':
									 [],
										 '邮编': '330000'},
						 '宜春市': {'下辖县级市':
									 ['樟树', '丰城', '高安', '丰城市', '樟树市', '高安市'],
										 '邮编': '336000'},
						 '吉安市': {'下辖县级市':
									 ['井冈山', '井冈山市'],
										 '邮编': '343000'},
						 '吉安': {'下辖县级市':
									 ['井冈山', '井冈山市'],
										 '邮编': '343000'},
						 '景德镇': {'下辖县级市':
									 ['乐平', '乐平市'],
										 '邮编': '333000'},
						 '南昌市': {'下辖县级市':
									 [],
										 '邮编': '330000'},
						 '宜春': {'下辖县级市':
									 ['樟树', '丰城', '高安', '丰城市', '樟树市', '高安市'],
										 '邮编': '336000'},
						 '景德镇市': {'下辖县级市':
									 ['乐平', '乐平市'],
										 '邮编': '333000'},
						 '萍乡': {'下辖县级市':
									 [],
										 '邮编': '337000'},
						 '上饶市': {'下辖县级市':
									 ['德兴', '德兴市'],
										 '邮编': '334000'},
						 '赣州': {'下辖县级市':
									 ['瑞金', '瑞金市'],
										 '邮编': '341000'},
						 '新余': {'下辖县级市':
									 [],
										 '邮编': '336500'},
						 '抚州市': {'下辖县级市':
									 [],
										 '邮编': '344000'},
						 '赣州市': {'下辖县级市':
									 ['瑞金', '瑞金市'],
										 '邮编': '341000'},
						 '鹰潭': {'下辖县级市':
									 ['贵溪', '贵溪市'],
										 '邮编': '335000'},
						 '萍乡市': {'下辖县级市':
									 [],
										 '邮编': '337000'}}},
			 '辽宁省': {'下辖地级市':
						 {'本溪市': {'下辖县级市':
									 [],
										 '邮编': '117000'},
						 '抚顺市': {'下辖县级市':
									 [],
										 '邮编': '113000'},
						 '本溪': {'下辖县级市':
									 [],
										 '邮编': '117000'},
						 '锦州市': {'下辖县级市':
									 ['凌海', '北镇', '凌海市', '北镇市'],
										 '邮编': '121000'},
						 '锦州': {'下辖县级市':
									 ['北镇', '凌海市', '凌海', '北镇市'],
										 '邮编': '121000'},
						 '葫芦岛': {'下辖县级市':
									 ['兴城', '兴城市'],
										 '邮编': '125000'},
						 '盘锦': {'下辖县级市':
									 [],
										 '邮编': '124000'},
						 '阜新': {'下辖县级市':
									 [],
										 '邮编': '123000'},
						 '丹东市': {'下辖县级市':
									 ['凤城市', '东港', '凤城', '东港市'],
										 '邮编': '118000'},
						 '铁岭市': {'下辖县级市':
									 ['调兵山市', '调兵山', '开原市', '开原'],
										 '邮编': '112000'},
						 '铁岭': {'下辖县级市':
									 ['调兵山', '开原市', '开原', '调兵山市'],
										 '邮编': '112000'},
						 '葫芦岛市': {'下辖县级市':
									 ['兴城市', '兴城'],
										 '邮编': '125000'},
						 '盘锦市': {'下辖县级市':
									 [],
										 '邮编': '124000'},
						 '辽阳市': {'下辖县级市':
									 ['灯塔', '灯塔市'],
										 '邮编': '111000'},
						 '沈阳市': {'下辖县级市':
									 ['新民市', '新民'],
										 '邮编': '110000'},
						 '抚顺': {'下辖县级市':
									 [],
										 '邮编': '113000'},
						 '辽阳': {'下辖县级市':
									 ['灯塔', '灯塔市'],
										 '邮编': '111000'},
						 '鞍山': {'下辖县级市':
									 ['海城', '海城市'],
										 '邮编': '114000'},
						 '鞍山市': {'下辖县级市':
									 ['海城', '海城市'],
										 '邮编': '114000'},
						 '营口市': {'下辖县级市':
									 ['盖州市', '盖州', '大石桥', '大石桥市'],
										 '邮编': '115000'},
						 '大连': {'下辖县级市':
									 ['庄河', '瓦房店', '庄河市', '瓦房店市'],
										 '邮编': '116000'},
						 '沈阳': {'下辖县级市':
									 ['新民市', '新民'],
										 '邮编': '110000'},
						 '朝阳市': {'下辖县级市':
									 ['凌源市', '北票市'],
										 '邮编': '122000'},
						 '阜新市': {'下辖县级市':
									 [],
										 '邮编': '123000'},
						 '营口': {'下辖县级市':
									 ['大石桥市', '大石桥', '盖州市', '盖州'],
										 '邮编': '115000'},
						 '大连市': {'下辖县级市':
									 ['庄河', '瓦房店', '庄河市', '瓦房店市'],
										 '邮编': '116000'},
						 '丹东': {'下辖县级市':
									 ['凤城市', '东港', '凤城', '东港市'],
										 '邮编': '118000'}}},
			 '上海市': {'下辖地级市':
						 {'上海': {'下辖县级市':
									 ['上海市', '上海'],
										 '邮编': '200000'},
						 '上海市': {'下辖县级市':
									 ['上海市', '上海'],
										 '邮编': '200000'}}},
			 '陕西省': {'下辖地级市':
						 {'铜川': {'下辖县级市':
									 [],
										 '邮编': '727000'},
						 '安康': {'下辖县级市':
									 [],
										 '邮编': '725000'},
						 '商洛市': {'下辖县级市':
									 [],
										 '邮编': '726000'},
						 '汉中市': {'下辖县级市':
									 [],
										 '邮编': '723000'},
						 '咸阳': {'下辖县级市':
									 ['兴平', '兴平市'],
										 '邮编': '712000'},
						 '渭南市': {'下辖县级市':
									 ['韩城', '华阴', '华阴市', '韩城市'],
										 '邮编': '714000'},
						 '榆林市': {'下辖县级市':
									 ['神木', '神木市'],
										 '邮编': '719000'},
						 '安康市': {'下辖县级市':
									 [],
										 '邮编': '725000'},
						 '西安': {'下辖县级市':
									 [],
										 '邮编': '710000'},
						 '铜川市': {'下辖县级市':
									 [],
										 '邮编': '727000'},
						 '榆林': {'下辖县级市':
									 ['神木', '神木市'],
										 '邮编': '719000'},
						 '商洛': {'下辖县级市':
									 [],
										 '邮编': '726000'},
						 '西安市': {'下辖县级市':
									 [],
										 '邮编': '710000'},
						 '延安市': {'下辖县级市':
									 [],
										 '邮编': '716000'},
						 '渭南': {'下辖县级市':
									 ['韩城', '华阴', '华阴市', '韩城市'],
										 '邮编': '714000'},
						 '咸阳市': {'下辖县级市':
									 ['兴平', '兴平市'],
										 '邮编': '712000'},
						 '汉中': {'下辖县级市':
									 [],
										 '邮编': '723000'},
						 '宝鸡市': {'下辖县级市':
									 [],
										 '邮编': '721000'},
						 '延安': {'下辖县级市':
									 [],
										 '邮编': '716000'},
						 '宝鸡': {'下辖县级市':
									 [],
										 '邮编': '721000'}}},
			 '宁夏': {'下辖地级市':
						 {'固原': {'下辖县级市':
									 [],
										 '邮编': '756000'},
						 '固原市': {'下辖县级市':
									 [],
										 '邮编': '756000'},
						 '石嘴山': {'下辖县级市':
									 [],
										 '邮编': '753000'},
						 '银川市': {'下辖县级市':
									 ['灵武', '灵武市'],
										 '邮编': '750000'},
						 '石嘴山市': {'下辖县级市':
									 [],
										 '邮编': '753000'},
						 '中卫': {'下辖县级市':
									 [],
										 '邮编': '751700'},
						 '吴忠市': {'下辖县级市':
									 ['青铜峡', '青铜峡市'],
										 '邮编': '751100'},
						 '吴忠': {'下辖县级市':
									 ['青铜峡', '青铜峡市'],
										 '邮编': '751100'},
						 '中卫市': {'下辖县级市':
									 [],
										 '邮编': '751700'},
						 '银川': {'下辖县级市':
									 ['灵武市', '灵武'],
										 '邮编': '750000'}}},
			 '内蒙古自治区': {'下辖地级市':
						 {'包头': {'下辖县级市':
									 [],
										 '邮编': '014000'},
						 '呼和浩特市': {'下辖县级市':
									 [],
										 '邮编': '010000'},
						 '鄂尔多斯市': {'下辖县级市':
									 [],
										 '邮编': '017200'},
						 '赤峰市': {'下辖县级市':
									 [],
										 '邮编': '024000'},
						 '乌兰察布市': {'下辖县级市':
									 ['丰镇', '丰镇市'],
										 '邮编': '012000'},
						 '鄂尔多斯': {'下辖县级市':
									 [],
										 '邮编': '017200'},
						 '包头市': {'下辖县级市':
									 [],
										 '邮编': '014000'},
						 '巴彦淖尔市': {'下辖县级市':
									 [],
										 '邮编': '015000'},
						 '通辽': {'下辖县级市':
									 ['霍林郭勒市', '霍林郭勒'],
										 '邮编': '028000'},
						 '呼伦贝尔市': {'下辖县级市':
									 ['根河', '额尔古纳', '根河市', '扎兰屯', '额尔古纳市', '满洲里', '牙克石', '扎兰屯市', '牙克石市', '满洲里市'],
										 '邮编': '021000'},
						 '乌海市': {'下辖县级市':
									 [],
										 '邮编': '016000'},
						 '巴彦淖尔': {'下辖县级市':
									 [],
										 '邮编': '015000'},
						 '呼伦贝尔': {'下辖县级市':
									 ['根河', '额尔古纳', '根河市', '扎兰屯', '额尔古纳市', '满洲里', '牙克石', '扎兰屯市', '牙克石市', '满洲里市'],
										 '邮编': '021000'},
						 '乌兰察布': {'下辖县级市':
									 ['丰镇', '丰镇市'],
										 '邮编': '012000'},
						 '赤峰': {'下辖县级市':
									 [],
										 '邮编': '024000'},
						 '乌海': {'下辖县级市':
									 [],
										 '邮编': '016000'},
						 '通辽市': {'下辖县级市':
									 ['霍林郭勒市', '霍林郭勒'],
										 '邮编': '028000'},
						 '呼和浩特': {'下辖县级市':
									 [],
										 '邮编': '010000'}}},
			 '内蒙古': {'下辖地级市':
						 {'包头': {'下辖县级市':
									 [],
										 '邮编': '014000'},
						 '呼和浩特市': {'下辖县级市':
									 [],
										 '邮编': '010000'},
						 '赤峰': {'下辖县级市':
									 [],
										 '邮编': '024000'},
						 '呼和浩特': {'下辖县级市':
									 [],
										 '邮编': '010000'},
						 '乌兰察布市': {'下辖县级市':
									 ['丰镇', '丰镇市'],
										 '邮编': '012000'},
						 '包头市': {'下辖县级市':
									 [],
										 '邮编': '014000'},
						 '鄂尔多斯': {'下辖县级市':
									 [],
										 '邮编': '017200'},
						 '呼伦贝尔': {'下辖县级市':
									 ['根河', '额尔古纳', '根河市', '扎兰屯', '额尔古纳市', '满洲里', '牙克石', '扎兰屯市', '牙克石市', '满洲里市'],
										 '邮编': '021000'},
						 '巴彦淖尔市': {'下辖县级市':
									 [],
										 '邮编': '015000'},
						 '巴彦淖尔': {'下辖县级市':
									 [],
										 '邮编': '015000'},
						 '乌海市': {'下辖县级市':
									 [],
										 '邮编': '016000'},
						 '鄂尔多斯市': {'下辖县级市':
									 [],
										 '邮编': '017200'},
						 '乌兰察布': {'下辖县级市':
									 ['丰镇', '丰镇市'],
										 '邮编': '012000'},
						 '呼伦贝尔市': {'下辖县级市':
									 ['根河', '额尔古纳', '根河市', '扎兰屯', '额尔古纳市', '满洲里', '牙克石', '扎兰屯市', '牙克石市', '满洲里市'],
										 '邮编': '021000'},
						 '通辽': {'下辖县级市':
									 ['霍林郭勒市', '霍林郭勒'],
										 '邮编': '028000'},
						 '乌海': {'下辖县级市':
									 [],
										 '邮编': '016000'},
						 '通辽市': {'下辖县级市':
									 ['霍林郭勒市', '霍林郭勒'],
										 '邮编': '028000'},
						 '赤峰市': {'下辖县级市':
									 [],
										 '邮编': '024000'}}},
			 '江苏': {'下辖地级市':
						 {'镇江': {'下辖县级市':
									 ['扬中', '句容市', '扬中市', '丹阳市', '丹阳', '句容'],
										 '邮编': '212000'},
						 '苏州市': {'下辖县级市':
									 ['常熟', '太仓', '常熟市', '太仓市', '张家港市', '昆山市', '昆山', '张家港'],
										 '邮编': '215000'},
						 '无锡市': {'下辖县级市':
									 ['江阴', '江阴市', '宜兴', '宜兴市'],
										 '邮编': '214000'},
						 '苏州': {'下辖县级市':
									 ['常熟', '太仓', '常熟市', '太仓市', '张家港市', '昆山市', '昆山', '张家港'],
										 '邮编': '215000'},
						 '连云港': {'下辖县级市':
									 [],
										 '邮编': '222000'},
						 '扬州市': {'下辖县级市':
									 ['高邮市', '仪征市', '高邮', '仪征'],
										 '邮编': '225000'},
						 '泰州': {'下辖县级市':
									 ['泰兴', '泰兴市', '靖江', '靖江市', '兴化市', '兴化'],
										 '邮编': '225300'},
						 '盐城': {'下辖县级市':
									 ['东台', '东台市'],
										 '邮编': '224000'},
						 '宿迁': {'下辖县级市':
									 [],
										 '邮编': '223800'},
						 '盐城市': {'下辖县级市':
									 ['东台', '东台市'],
										 '邮编': '224000'},
						 '宿迁市': {'下辖县级市':
									 [],
										 '邮编': '223800'},
						 '无锡': {'下辖县级市':
									 ['江阴', '江阴市', '宜兴', '宜兴市'],
										 '邮编': '214000'},
						 '常州市': {'下辖县级市':
									 ['溧阳', '溧阳市'],
										 '邮编': '213000'},
						 '常州': {'下辖县级市':
									 ['溧阳市', '溧阳'],
										 '邮编': '213000'},
						 '扬州': {'下辖县级市':
									 ['高邮市', '仪征市', '高邮', '仪征'],
										 '邮编': '225000'},
						 '泰州市': {'下辖县级市':
									 ['泰兴', '泰兴市', '靖江', '靖江市', '兴化市', '兴化'],
										 '邮编': '225300'},
						 '淮安': {'下辖县级市':
									 [],
										 '邮编': '223001'},
						 '南京市': {'下辖县级市':
									 [],
										 '邮编': '210000'},
						 '徐州市': {'下辖县级市':
									 ['新沂市', '邳州', '新沂', '邳州市'],
										 '邮编': '221000'},
						 '南通市': {'下辖县级市':
									 ['如皋', '启东市', '海门', '海门市', '如皋市', '启东'],
										 '邮编': '226000'},
						 '南京': {'下辖县级市':
									 [],
										 '邮编': '210000'},
						 '连云港市': {'下辖县级市':
									 [],
										 '邮编': '222000'},
						 '南通': {'下辖县级市':
									 ['如皋', '启东市', '海门', '海门市', '如皋市', '启东'],
										 '邮编': '226000'},
						 '徐州': {'下辖县级市':
									 ['新沂', '邳州', '新沂市', '邳州市'],
										 '邮编': '221000'},
						 '镇江市': {'下辖县级市':
									 ['扬中', '句容市', '扬中市', '丹阳市', '丹阳', '句容'],
										 '邮编': '212000'},
						 '淮安市': {'下辖县级市':
									 [],
										 '邮编': '223001'}}},
			 '吉林省': {'下辖地级市':
						 {'松原市': {'下辖县级市':
									 ['扶余市', '扶余'],
										 '邮编': '138000'},
						 '延边朝鲜族自治州': {'下辖县级市':
									 ['延吉市','图们市','敦化市','龙井市','珲春市','和龙市','延吉','图们','敦化','龙井','珲春','和龙'],
										 '邮编': '133000'},
						 '白山市': {'下辖县级市':
									 ['临江市', '临江'],
										 '邮编': '134300'},
						 '长春市': {'下辖县级市':
									 ['榆树市', '德惠市', '榆树', '德惠'],
										 '邮编': '130000'},
						 '四平': {'下辖县级市':
									 ['公主岭', '双辽市', '公主岭市', '双辽'],
										 '邮编': '136000'},
						 '白山': {'下辖县级市':
									 ['临江市', '临江'],
										 '邮编': '134300'},
						 '吉林市': {'下辖县级市':
									 ['舒兰市', '磐石市', '桦甸市', '蛟河市', '桦甸', '蛟河', '磐石', '舒兰'],
										 '邮编': '132000'},
						 '白城': {'下辖县级市':
									 ['大安市', '大安', '洮南市', '洮南'],
										 '邮编': '137000'},
						 '四平市': {'下辖县级市':
									 ['双辽', '公主岭市', '双辽市', '公主岭'],
										 '邮编': '136000'},
						 '长春': {'下辖县级市':
									 ['榆树市', '德惠市', '榆树', '德惠'],
										 '邮编': '130000'},
						 '白城市': {'下辖县级市':
									 ['大安市', '大安', '洮南', '洮南市'],
										 '邮编': '137000'},
						 '通化市': {'下辖县级市':
									 ['集安市', '梅河口', '集安', '梅河口市'],
										 '邮编': '134000'},
						 '辽源': {'下辖县级市':
									 [],
										 '邮编': '136200'},
						 '松原': {'下辖县级市':
									 ['扶余市', '扶余'],
										 '邮编': '138000'},
						 '辽源市': {'下辖县级市':
									 [],
										 '邮编': '136200'},
						 '通化': {'下辖县级市':
									 ['梅河口', '集安', '集安市', '梅河口市'],
										 '邮编': '134000'},
						 '吉林': {'下辖县级市':
									 ['舒兰市', '磐石市', '桦甸市', '磐石', '桦甸', '蛟河', '蛟河市', '舒兰'],
										 '邮编': '132000'}}},
			 '河南省': {'下辖地级市':
						 {'漯河': {'下辖县级市':
									 [],
										 '邮编': '462000'},
						 '新乡市': {'下辖县级市':
									 ['辉县市', '卫辉', '卫辉市', '辉县'],
										 '邮编': '453000'},
						 '三门峡': {'下辖县级市':
									 ['灵宝市', '灵宝', '义马市', '义马'],
										 '邮编': '472000'},
						 '许昌': {'下辖县级市':
									 ['禹州', '禹州市', '长葛', '长葛市'],
										 '邮编': '461000'},
						 '驻马店市': {'下辖县级市':
									 [],
										 '邮编': '463000'},
						 '开封市': {'下辖县级市':
									 [],
										 '邮编': '475000'},
						 '南阳市': {'下辖县级市':
									 ['邓州市', '邓州'],
										 '邮编': '473000'},
						 '商丘': {'下辖县级市':
									 ['永城市', '永城'],
										 '邮编': '476000'},
						 '平顶山': {'下辖县级市':
									 ['汝州市', '舞钢市', '汝州', '舞钢'],
										 '邮编': '467000'},
						 '鹤壁市': {'下辖县级市':
									 [],
										 '邮编': '458000'},
						 '安阳': {'下辖县级市':
									 ['林州', '林州市'],
										 '邮编': '455000'},
						 '信阳市': {'下辖县级市':
									 [],
										 '邮编': '464000'},
						 '洛阳市': {'下辖县级市':
									 ['偃师市', '偃师'],
										 '邮编': '471000'},
						 '新乡': {'下辖县级市':
									 ['辉县', '卫辉', '卫辉市', '辉县市'],
										 '邮编': '453000'},
						 '南阳': {'下辖县级市':
									 ['邓州市', '邓州'],
										 '邮编': '473000'},
						 '漯河市': {'下辖县级市':
									 [],
										 '邮编': '462000'},
						 '郑州市': {'下辖县级市':
									 ['新郑市', '巩义', '荥阳市', '登封', '荥阳', '新密市', '巩义市', '新密', '登封市', '新郑'],
										 '邮编': '450000'},
						 '三门峡市': {'下辖县级市':
									 ['灵宝市', '灵宝', '义马市', '义马'],
										 '邮编': '472000'},
						 '濮阳': {'下辖县级市':
									 [],
										 '邮编': '457000'},
						 '商丘市': {'下辖县级市':
									 ['永城市', '永城'],
										 '邮编': '476000'},
						 '平顶山市': {'下辖县级市':
									 ['汝州市', '舞钢', '汝州', '舞钢市'],
										 '邮编': '467000'},
						 '鹤壁': {'下辖县级市':
									 [],
										 '邮编': '458000'},
						 '焦作市': {'下辖县级市':
									 ['孟州市', '孟州', '沁阳市', '沁阳'],
										 '邮编': '454150'},
						 '开封': {'下辖县级市':
									 [],
										 '邮编': '475000'},
						 '信阳': {'下辖县级市':
									 [],
										 '邮编': '464000'},
						 '濮阳市': {'下辖县级市':
									 [],
										 '邮编': '457000'},
						 '安阳市': {'下辖县级市':
									 ['林州', '林州市'],
										 '邮编': '455000'},
						 '周口': {'下辖县级市':
									 ['项城市', '项城'],
										 '邮编': '466000'},
						 '郑州': {'下辖县级市':
									 ['巩义', '新郑市', '荥阳市', '登封', '荥阳', '新密市', '巩义市', '新密', '登封市', '新郑'],
										 '邮编': '450000'},
						 '驻马店': {'下辖县级市':
									 [],
										 '邮编': '463000'},
						 '焦作': {'下辖县级市':
									 ['孟州市', '孟州', '沁阳', '沁阳市'],
										 '邮编': '454150'},
						 '洛阳': {'下辖县级市':
									 ['偃师市', '偃师'],
										 '邮编': '471000'},
						 '周口市': {'下辖县级市':
									 ['项城市', '项城'],
										 '邮编': '466000'},
						 '许昌市': {'下辖县级市':
									 ['禹州', '禹州市', '长葛', '长葛市'],
										 '邮编': '461000'}}},
			 '北京': {'下辖地级市':
						 {'北京市': {'下辖县级市':
									 ['北京市', '北京'],
										 '邮编': '100000'},
						 '北京': {'下辖县级市':
									 ['北京市', '北京'],
										 '邮编': '100000'}}},
			 '河北省': {'下辖地级市':
						 {'张家口市': {'下辖县级市':
									 [],
										 '邮编': '075000'},
						 '衡水市': {'下辖县级市':
									 ['深州市', '深州'],
										 '邮编': '053000'},
						 '沧州': {'下辖县级市':
									 ['黄骅', '河间市', '河间', '泊头市', '黄骅市', '任丘市', '任丘', '泊头'],
										 '邮编': '061000'},
						 '廊坊市': {'下辖县级市':
									 ['三河市', '三河', '霸州市', '霸州'],
										 '邮编': '065000'},
						 '承德市': {'下辖县级市':
									 ['平泉市', '平泉'],
										 '邮编': '067000'},
						 '石家庄市': {'下辖县级市':
									 ['新乐市', '辛集市', '新乐', '晋州市', '晋州', '辛集'],
										 '邮编': '050000'},
						 '张家口': {'下辖县级市':
									 [],
										 '邮编': '075000'},
						 '保定': {'下辖县级市':
									 ['高碑店市', '安国市', '定州', '涿州市', '涿州', '高碑店', '安国', '定州市'],
										 '邮编': '071000'},
						 '廊坊': {'下辖县级市':
									 ['三河市', '霸州市', '三河', '霸州'],
										 '邮编': '065000'},
						 '秦皇岛市': {'下辖县级市':
									 [],
										 '邮编': '066000'},
						 '邯郸': {'下辖县级市':
									 ['武安', '武安市'],
										 '邮编': '056000'},
						 '衡水': {'下辖县级市':
									 ['深州', '深州市'],
										 '邮编': '053000'},
						 '邢台市': {'下辖县级市':
									 ['沙河市', '南宫', '沙河', '南宫市'],
										 '邮编': '054000'},
						 '保定市': {'下辖县级市':
									 ['高碑店市', '安国市', '定州', '涿州市', '涿州', '高碑店', '安国', '定州市'],
										 '邮编': '071000'},
						 '石家庄': {'下辖县级市':
									 ['新乐市', '辛集市', '新乐', '晋州市', '晋州', '辛集'],
										 '邮编': '050000'},
						 '承德': {'下辖县级市':
									 ['平泉市', '平泉'],
										 '邮编': '067000'},
						 '唐山市': {'下辖县级市':
									 ['遵化', '遵化市', '迁安市', '迁安'],
										 '邮编': '063000'},
						 '秦皇岛': {'下辖县级市':
									 [],
										 '邮编': '066000'},
						 '邯郸市': {'下辖县级市':
									 ['武安市', '武安'],
										 '邮编': '056000'},
						 '邢台': {'下辖县级市':
									 ['沙河市', '南宫', '沙河', '南宫市'],
										 '邮编': '054000'},
						 '沧州市': {'下辖县级市':
									 ['河间市', '黄骅', '河间', '泊头市', '黄骅市', '任丘市', '任丘', '泊头'],
										 '邮编': '061000'},
						 '唐山': {'下辖县级市':
									 ['遵化', '遵化市', '迁安市', '迁安'],
										 '邮编': '063000'}}},
			 '黑龙江': {'下辖地级市':
						 {'鹤岗市': {'下辖县级市':
									 [],
										 '邮编': '154100'},
						 '大兴安岭地区': {'下辖县级市':
									 [],
										 '邮编': '165000'},
						 '大兴安岭': {'下辖县级市':
									 [],
										 '邮编': '165000'},
						 '伊春市': {'下辖县级市':
									 ['铁力市', '铁力'],
										 '邮编': '153000'},
						 '鸡西': {'下辖县级市':
									 ['密山市', '虎林', '密山', '虎林市'],
										 '邮编': '158100'},
						 '鸡西市': {'下辖县级市':
									 ['虎林市', '密山市', '密山', '虎林'],
										 '邮编': '158100'},
						 '哈尔滨': {'下辖县级市':
									 ['尚志市', '五常', '尚志', '五常市'],
										 '邮编': '150000'},
						 '佳木斯': {'下辖县级市':
									 ['同江市', '同江', '抚远', '富锦市', '抚远市', '富锦'],
										 '邮编': '154000'},
						 '黑河市': {'下辖县级市':
									 ['五大连池', '五大连池市', '北安市', '北安'],
										 '邮编': '164300'},
						 '齐齐哈尔': {'下辖县级市':
									 ['讷河', '讷河市'],
										 '邮编': '161000'},
						 '齐齐哈尔市': {'下辖县级市':
									 ['讷河', '讷河市'],
										 '邮编': '161000'},
						 '双鸭山市': {'下辖县级市':
									 [],
										 '邮编': '155100'},
						 '大庆': {'下辖县级市':
									 [],
										 '邮编': '163000'},
						 '牡丹江': {'下辖县级市':
									 ['东宁', '海林', '穆棱', '宁安市', '海林市', '宁安', '东宁市', '穆棱市', '绥芬河市', '绥芬河'],
										 '邮编': '157000'},
						 '双鸭山': {'下辖县级市':
									 [],
										 '邮编': '155100'},
						 '黑河': {'下辖县级市':
									 ['五大连池', '五大连池市', '北安市', '北安'],
										 '邮编': '164300'},
						 '七台河': {'下辖县级市':
									 [],
										 '邮编': '154600'},
						 '七台河市': {'下辖县级市':
									 [],
										 '邮编': '154600'},
						 '鹤岗': {'下辖县级市':
									 [],
										 '邮编': '154100'},
						 '伊春': {'下辖县级市':
									 ['铁力市', '铁力'],
										 '邮编': '153000'},
						 '哈尔滨市': {'下辖县级市':
									 ['尚志市', '尚志', '五常', '五常市'],
										 '邮编': '150000'},
						 '佳木斯市': {'下辖县级市':
									 ['同江市', '同江', '抚远', '富锦市', '抚远市', '富锦'],
										 '邮编': '154000'},
						 '牡丹江市': {'下辖县级市':
									 ['东宁', '海林', '穆棱', '宁安市', '海林市', '东宁市', '宁安', '穆棱市', '绥芬河市', '绥芬河'],
										 '邮编': '157000'},
						 '绥化市': {'下辖县级市':
									 ['肇东', '海伦市', '安达', '海伦', '肇东市', '安达市'],
										 '邮编': '152000'},
						 '大庆市': {'下辖县级市':
									 [],
										 '邮编': '163000'},
						 '绥化': {'下辖县级市':
									 ['肇东', '海伦市', '安达', '海伦', '肇东市', '安达市'],
										 '邮编': '152000'}}},
			 '福建省': {'下辖地级市':
						 {'宁德': {'下辖县级市':
									 ['福安市', '福鼎市', '福鼎', '福安'],
										 '邮编': '352000'},
						 '莆田市': {'下辖县级市':
									 [],
										 '邮编': '351100'},
						 '南平市': {'下辖县级市':
									 ['武夷山市', '武夷山', '邵武', '建瓯市', '邵武市', '建瓯'],
										 '邮编': '353000'},
						 '厦门市': {'下辖县级市':
									 [],
										 '邮编': '361000'},
						 '南平': {'下辖县级市':
									 ['武夷山市', '武夷山', '邵武', '建瓯市', '邵武市', '建瓯'],
										 '邮编': '353000'},
						 '福州': {'下辖县级市':
									 ['福清', '福清市', '长乐市', '长乐'],
										 '邮编': '350000'},
						 '龙岩': {'下辖县级市':
									 ['漳平', '漳平市'],
										 '邮编': '364000'},
						 '福州市': {'下辖县级市':
									 ['福清', '长乐市', '长乐', '福清市'],
										 '邮编': '350000'},
						 '漳州市': {'下辖县级市':
									 ['龙海市', '龙海'],
										 '邮编': '363000'},
						 '漳州': {'下辖县级市':
									 ['龙海市', '龙海'],
										 '邮编': '363000'},
						 '泉州': {'下辖县级市':
									 ['南安市', '石狮', '南安', '晋江', '晋江市', '石狮市'],
										 '邮编': '362000'},
						 '厦门': {'下辖县级市':
									 [],
										 '邮编': '361000'},
						 '宁德市': {'下辖县级市':
									 ['福安市', '福鼎市', '福鼎', '福安'],
										 '邮编': '352000'},
						 '莆田': {'下辖县级市':
									 [],
										 '邮编': '351100'},
						 '三明': {'下辖县级市':
									 ['永安', '永安市'],
										 '邮编': '365000'},
						 '龙岩市': {'下辖县级市':
									 ['漳平', '漳平市'],
										 '邮编': '364000'},
						 '泉州市': {'下辖县级市':
									 ['南安市', '石狮', '南安', '晋江', '晋江市', '石狮市'],
										 '邮编': '362000'},
						 '三明市': {'下辖县级市':
									 ['永安', '永安市'],
										 '邮编': '365000'}}},
			 '新疆': {'下辖地级市':
						 {'乌鲁木齐': {'下辖县级市':
									 [],
										 '邮编': '830000'},
						 '克拉玛依': {'下辖县级市':
									 [],
										 '邮编': '834000'},
						 '哈密': {'下辖县级市':
									 [],
										 '邮编': '839000'},
						 '塔城地区': {'下辖县级市':
										 ['塔城市','乌苏市','塔城','乌苏'],
											 '邮编':'834700'},
						 '阿勒泰地区': {'下辖县级市':
										 ['阿勒泰市','阿勒泰'],
											 '邮编':'836500'},
						 '阿克苏地区': {'下辖县级市':
										 ['阿克苏市','阿克苏'],
											 '邮编':'843000'},
						 '喀什地区': {'下辖县级市':
										 ['喀什市','喀什'],
											 '邮编':'844000'},
						 '和田地区': {'下辖县级市':
										 ['和田市','和田'],
											 '邮编':'848000'},
						 '昌吉回族自治州': {'下辖县级市':
										 ['昌吉市','阜康市','昌吉','阜康'],
											 '邮编':'831100'},
						 '博尔塔拉蒙古自治州': {'下辖县级市':
										 ['博乐市','阿拉山口市','博乐市','阿拉山口'],
											 '邮编':'833400'},
						 '伊犁哈萨克自治州': {'下辖县级市':
										 ['伊宁市','奎屯市','霍尔果斯市','伊宁','奎屯','霍尔果斯'],
											 '邮编':'835000'},
						 '巴音郭楞蒙古自治州': {'下辖县级市':
										 ['库尔勒市','库尔勒'],
											 '邮编':'841000'},
						 '克孜勒苏柯尔克孜自治州': {'下辖县级市':
										 ['阿图什市','阿图什'],
											 '邮编':'845350'},
						 '塔城': {'下辖县级市':
										 ['塔城市','乌苏市','塔城','乌苏'],
											 '邮编':'834700'},
						 '阿勒泰': {'下辖县级市':
										 ['阿勒泰市','阿勒泰'],
											 '邮编':'836500'},
						 '阿克苏': {'下辖县级市':
										 ['阿克苏市','阿克苏'],
											 '邮编':'843000'},
						 '喀什': {'下辖县级市':
										 ['喀什市','喀什'],
											 '邮编':'844000'},
						 '和田': {'下辖县级市':
										 ['和田市','和田'],
											 '邮编':'848000'},
						 '昌吉': {'下辖县级市':
										 ['昌吉市','阜康市','昌吉','阜康'],
											 '邮编':'831100'},
						 '博尔塔拉': {'下辖县级市':
										 ['博乐市','阿拉山口市','博乐市','阿拉山口'],
											 '邮编':'833400'},
						 '伊犁哈萨克': {'下辖县级市':
										 ['伊宁市','奎屯市','霍尔果斯市','伊宁','奎屯','霍尔果斯'],
											 '邮编':'835000'},
						 '巴音郭楞': {'下辖县级市':
										 ['库尔勒市','库尔勒'],
											 '邮编':'841000'},
						 '克孜勒苏柯尔克孜': {'下辖县级市':
										 ['阿图什市','阿图什'],
											 '邮编':'845350'},
						 '克拉玛依市': {'下辖县级市':
									 [],
										 '邮编': '834000'},
						 '乌鲁木齐市': {'下辖县级市':
									 [],
										 '邮编': '830000'},
						 '吐鲁番': {'下辖县级市':
									 [],
										 '邮编': '838000'},
						 '哈密市': {'下辖县级市':
									 [],
										 '邮编': '839000'},
						 '吐鲁番市': {'下辖县级市':
									 [],
										 '邮编': '838000'}}},
			 '天津': {'下辖地级市':
						 {'天津市': {'下辖县级市':
									 ['天津市', '天津'],
										 '邮编': '300000'},
						 '天津': {'下辖县级市':
									 ['天津市', '天津'],
										 '邮编': '300000'}}},
			 '江苏省': {'下辖地级市':
						 {'镇江': {'下辖县级市':
									 ['扬中', '句容市', '扬中市', '丹阳市', '丹阳', '句容'],
										 '邮编': '212000'},
						 '苏州市': {'下辖县级市':
									 ['常熟', '太仓', '常熟市', '太仓市', '张家港市', '昆山市', '昆山', '张家港'],
										 '邮编': '215000'},
						 '无锡市': {'下辖县级市':
									 ['江阴', '江阴市', '宜兴', '宜兴市'],
										 '邮编': '214000'},
						 '苏州': {'下辖县级市':
									 ['常熟', '太仓', '常熟市', '太仓市', '张家港市', '昆山市', '昆山', '张家港'],
										 '邮编': '215000'},
						 '连云港': {'下辖县级市':
									 [],
										 '邮编': '222000'},
						 '扬州市': {'下辖县级市':
									 ['高邮市', '仪征市', '高邮', '仪征'],
										 '邮编': '225000'},
						 '泰州': {'下辖县级市':
									 ['泰兴', '泰兴市', '靖江', '靖江市', '兴化市', '兴化'],
										 '邮编': '225300'},
						 '盐城': {'下辖县级市':
									 ['东台', '东台市'],
										 '邮编': '224000'},
						 '盐城市': {'下辖县级市':
									 ['东台', '东台市'],
										 '邮编': '224000'},
						 '镇江市': {'下辖县级市':
									 ['扬中', '句容市', '扬中市', '丹阳市', '丹阳', '句容'],
										 '邮编': '212000'},
						 '宿迁市': {'下辖县级市':
									 [],
										 '邮编': '223800'},
						 '无锡': {'下辖县级市':
									 ['江阴', '江阴市', '宜兴', '宜兴市'],
										 '邮编': '214000'},
						 '常州市': {'下辖县级市':
									 ['溧阳', '溧阳市'],
										 '邮编': '213000'},
						 '常州': {'下辖县级市':
									 ['溧阳市', '溧阳'],
										 '邮编': '213000'},
						 '扬州': {'下辖县级市':
									 ['高邮市', '仪征市', '高邮', '仪征'],
										 '邮编': '225000'},
						 '泰州市': {'下辖县级市':
									 ['泰兴', '泰兴市', '靖江', '靖江市', '兴化市', '兴化'],
										 '邮编': '225300'},
						 '淮安': {'下辖县级市':
									 [],
										 '邮编': '223001'},
						 '宿迁': {'下辖县级市':
									 [],
										 '邮编': '223800'},
						 '南京市': {'下辖县级市':
									 [],
										 '邮编': '210000'},
						 '徐州市': {'下辖县级市':
									 ['新沂市', '邳州', '新沂', '邳州市'],
										 '邮编': '221000'},
						 '南通市': {'下辖县级市':
									 ['如皋', '启东市', '海门', '海门市', '如皋市', '启东'],
										 '邮编': '226000'},
						 '南京': {'下辖县级市':
									 [],
										 '邮编': '210000'},
						 '连云港市': {'下辖县级市':
									 [],
										 '邮编': '222000'},
						 '南通': {'下辖县级市':
									 ['如皋', '启东市', '海门', '海门市', '如皋市', '启东'],
										 '邮编': '226000'},
						 '徐州': {'下辖县级市':
									 ['新沂', '邳州', '新沂市', '邳州市'],
										 '邮编': '221000'},
						 '淮安市': {'下辖县级市':
									 [],
										 '邮编': '223001'}}},
			 '宁夏回族自治区': {'下辖地级市':
						 {'中卫': {'下辖县级市':
									 [],
										 '邮编': '751700'},
						 '石嘴山市': {'下辖县级市':
									 [],
										 '邮编': '753000'},
						 '固原市': {'下辖县级市':
									 [],
										 '邮编': '756000'},
						 '石嘴山': {'下辖县级市':
									 [],
										 '邮编': '753000'},
						 '固原': {'下辖县级市':
									 [],
										 '邮编': '756000'},
						 '吴忠市': {'下辖县级市':
									 ['青铜峡', '青铜峡市'],
										 '邮编': '751100'},
						 '吴忠': {'下辖县级市':
									 ['青铜峡', '青铜峡市'],
										 '邮编': '751100'},
						 '银川': {'下辖县级市':
									 ['灵武市', '灵武'],
										 '邮编': '750000'},
						 '中卫市': {'下辖县级市':
									 [],
										 '邮编': '751700'},
						 '银川市': {'下辖县级市':
									 ['灵武', '灵武市'],
										 '邮编': '750000'}}},
			 '河北': {'下辖地级市':
						 {'廊坊': {'下辖县级市':
									 ['三河市', '霸州市', '三河', '霸州'],
										 '邮编': '065000'},
						 '衡水市': {'下辖县级市':
									 ['深州市', '深州'],
										 '邮编': '053000'},
						 '沧州': {'下辖县级市':
									 ['黄骅', '河间市', '河间', '泊头市', '黄骅市', '任丘市', '任丘', '泊头'],
										 '邮编': '061000'},
						 '廊坊市': {'下辖县级市':
									 ['三河市', '三河', '霸州市', '霸州'],
										 '邮编': '065000'},
						 '张家口市': {'下辖县级市':
									 [],
										 '邮编': '075000'},
						 '石家庄市': {'下辖县级市':
									 ['新乐市', '辛集市', '新乐', '晋州市', '晋州', '辛集'],
										 '邮编': '050000'},
						 '张家口': {'下辖县级市':
									 [],
										 '邮编': '075000'},
						 '保定': {'下辖县级市':
									 ['高碑店市', '安国市', '定州', '涿州市', '涿州', '高碑店', '安国', '定州市'],
										 '邮编': '071000'},
						 '秦皇岛市': {'下辖县级市':
									 [],
										 '邮编': '066000'},
						 '承德市': {'下辖县级市':
									 ['平泉市', '平泉'],
										 '邮编': '067000'},
						 '邯郸市': {'下辖县级市':
									 ['武安市', '武安'],
										 '邮编': '056000'},
						 '衡水': {'下辖县级市':
									 ['深州', '深州市'],
										 '邮编': '053000'},
						 '邢台市': {'下辖县级市':
									 ['沙河市', '南宫', '沙河', '南宫市'],
										 '邮编': '054000'},
						 '保定市': {'下辖县级市':
									 ['高碑店市', '安国市', '定州', '涿州市', '涿州', '高碑店', '安国', '定州市'],
										 '邮编': '071000'},
						 '石家庄': {'下辖县级市':
									 ['新乐市', '辛集市', '新乐', '晋州市', '晋州', '辛集'],
										 '邮编': '050000'},
						 '承德': {'下辖县级市':
									 ['平泉市', '平泉'],
										 '邮编': '067000'},
						 '唐山市': {'下辖县级市':
									 ['遵化', '遵化市', '迁安市', '迁安'],
										 '邮编': '063000'},
						 '秦皇岛': {'下辖县级市':
									 [],
										 '邮编': '066000'},
						 '邯郸': {'下辖县级市':
									 ['武安', '武安市'],
										 '邮编': '056000'},
						 '邢台': {'下辖县级市':
									 ['沙河市', '南宫', '沙河', '南宫市'],
										 '邮编': '054000'},
						 '沧州市': {'下辖县级市':
									 ['河间市', '黄骅', '河间', '泊头市', '黄骅市', '任丘市', '任丘', '泊头'],
										 '邮编': '061000'},
						 '唐山': {'下辖县级市':
									 ['遵化', '遵化市', '迁安市', '迁安'],
										 '邮编': '063000'}}},
			 '河南': {'下辖地级市':
						 {'周口': {'下辖县级市':
									 ['项城市', '项城'],
										 '邮编': '466000'},
						 '漯河': {'下辖县级市':
									 [],
										 '邮编': '462000'},
						 '焦作市': {'下辖县级市':
									 ['孟州市', '孟州', '沁阳市', '沁阳'],
										 '邮编': '454150'},
						 '新乡市': {'下辖县级市':
									 ['辉县市', '卫辉', '卫辉市', '辉县'],
										 '邮编': '453000'},
						 '开封市': {'下辖县级市':
									 [],
										 '邮编': '475000'},
						 '郑州市': {'下辖县级市':
									 ['新郑市', '巩义', '荥阳市', '登封', '荥阳', '新密市', '巩义市', '新密', '登封市', '新郑'],
										 '邮编': '450000'},
						 '商丘': {'下辖县级市':
									 ['永城市', '永城'],
										 '邮编': '476000'},
						 '鹤壁市': {'下辖县级市':
									 [],
										 '邮编': '458000'},
						 '安阳': {'下辖县级市':
									 ['林州', '林州市'],
										 '邮编': '455000'},
						 '南阳市': {'下辖县级市':
									 ['邓州市', '邓州'],
										 '邮编': '473000'},
						 '驻马店': {'下辖县级市':
									 [],
										 '邮编': '463000'},
						 '许昌': {'下辖县级市':
									 ['禹州', '禹州市', '长葛', '长葛市'],
										 '邮编': '461000'},
						 '新乡': {'下辖县级市':
									 ['辉县', '卫辉', '卫辉市', '辉县市'],
										 '邮编': '453000'},
						 '洛阳市': {'下辖县级市':
									 ['偃师市', '偃师'],
										 '邮编': '471000'},
						 '濮阳市': {'下辖县级市':
									 [],
										 '邮编': '457000'},
						 '漯河市': {'下辖县级市':
									 [],
										 '邮编': '462000'},
						 '平顶山': {'下辖县级市':
									 ['汝州市', '舞钢市', '汝州', '舞钢'],
										 '邮编': '467000'},
						 '三门峡市': {'下辖县级市':
									 ['灵宝市', '灵宝', '义马市', '义马'],
										 '邮编': '472000'},
						 '濮阳': {'下辖县级市':
									 [],
										 '邮编': '457000'},
						 '三门峡': {'下辖县级市':
									 ['灵宝市', '灵宝', '义马市', '义马'],
										 '邮编': '472000'},
						 '平顶山市': {'下辖县级市':
									 ['汝州市', '舞钢', '汝州', '舞钢市'],
										 '邮编': '467000'},
						 '鹤壁': {'下辖县级市':
									 [],
										 '邮编': '458000'},
						 '商丘市': {'下辖县级市':
									 ['永城市', '永城'],
										 '邮编': '476000'},
						 '开封': {'下辖县级市':
									 [],
										 '邮编': '475000'},
						 '信阳': {'下辖县级市':
									 [],
										 '邮编': '464000'},
						 '南阳': {'下辖县级市':
									 ['邓州市', '邓州'],
										 '邮编': '473000'},
						 '安阳市': {'下辖县级市':
									 ['林州', '林州市'],
										 '邮编': '455000'},
						 '郑州': {'下辖县级市':
									 ['巩义', '新郑市', '荥阳市', '登封', '荥阳', '新密市', '巩义市', '新密', '登封市', '新郑'],
										 '邮编': '450000'},
						 '信阳市': {'下辖县级市':
									 [],
										 '邮编': '464000'},
						 '焦作': {'下辖县级市':
									 ['孟州市', '孟州', '沁阳', '沁阳市'],
										 '邮编': '454150'},
						 '洛阳': {'下辖县级市':
									 ['偃师市', '偃师'],
										 '邮编': '471000'},
						 '周口市': {'下辖县级市':
									 ['项城市', '项城'],
										 '邮编': '466000'},
						 '驻马店市': {'下辖县级市':
									 [],
										 '邮编': '463000'},
						 '许昌市': {'下辖县级市':
									 ['禹州', '禹州市', '长葛', '长葛市'],
										 '邮编': '461000'}}},
			 '青海省': {'下辖地级市':
						 {'西宁': {'下辖县级市':
									 [],
										 '邮编': '810000'},
						 '海西蒙古族藏族自治州': {'下辖县级市':
										 ['德令哈市','格尔木市','德令哈','格尔木'],
											 '邮编':'817000'},
						 '海西': {'下辖县级市':
										 ['德令哈市','格尔木市','德令哈','格尔木'],
											 '邮编':'817000'},
						 '西宁市': {'下辖县级市':
									 [],
										 '邮编': '810000'},
						 '海东市': {'下辖县级市':
									 [],
										 '邮编': '810699'},
						 '海东': {'下辖县级市':
									 [],
										 '邮编': '810699'}}},
			 '湖北省': {'下辖地级市':
						 {'随州市': {'下辖县级市':
									 ['广水市', '广水'],
										 '邮编': '441300'},
						 '武汉市': {'下辖县级市':
									 [],
										 '邮编': '430000'},
						 '恩施土家族苗族自治州': {'下辖县级市':
									 ['恩施市','利川市','恩施','利川',],
										 '邮编': '445000'},
						 '襄阳市': {'下辖县级市':
									 ['枣阳市', '宜城市', '老河口市', '枣阳', '宜城', '老河口'],
										 '邮编': '441000'},
						 '鄂州': {'下辖县级市':
									 [],
										 '邮编': '436000'},
						 '十堰市': {'下辖县级市':
									 ['丹江口', '丹江口市'],
										 '邮编': '442000'},
						 '十堰': {'下辖县级市':
									 ['丹江口', '丹江口市'],
										 '邮编': '442000'},
						 '孝感': {'下辖县级市':
									 ['安陆市', '应城市', '汉川市', '应城', '汉川', '安陆'],
										 '邮编': '432000'},
						 '鄂州市': {'下辖县级市':
									 [],
										 '邮编': '436000'},
						 '黄冈市': {'下辖县级市':
									 ['麻城', '武穴', '麻城市', '武穴市'],
										 '邮编': '438000'},
						 '荆门市': {'下辖县级市':
									 ['钟祥', '钟祥市'],
										 '邮编': '448000'},
						 '宜昌市': {'下辖县级市':
									 ['宜都', '枝江', '枝江市', '宜都市', '当阳市', '当阳'],
										 '邮编': '443000'},
						 '荆门': {'下辖县级市':
									 ['钟祥', '钟祥市'],
										 '邮编': '448000'},
						 '黄冈': {'下辖县级市':
									 ['武穴', '麻城', '武穴市', '麻城市'],
										 '邮编': '438000'},
						 '荆州市': {'下辖县级市':
									 ['洪湖', '洪湖市', '石首', '松滋市', '石首市', '松滋'],
										 '邮编': '434000'},
						 '宜昌': {'下辖县级市':
									 ['宜都', '枝江', '枝江市', '宜都市', '当阳市', '当阳'],
										 '邮编': '443000'},
						 '黄石': {'下辖县级市':
									 ['大冶', '大冶市'],
										 '邮编': '435000'},
						 '咸宁': {'下辖县级市':
									 ['赤壁', '赤壁市'],
										 '邮编': '437000'},
						 '荆州': {'下辖县级市':
									 ['洪湖', '洪湖市', '石首', '松滋市', '石首市', '松滋'],
										 '邮编': '434000'},
						 '武汉': {'下辖县级市':
									 [],
										 '邮编': '430000'},
						 '黄石市': {'下辖县级市':
									 ['大冶', '大冶市'],
										 '邮编': '435000'},
						 '随州': {'下辖县级市':
									 ['广水市', '广水'],
										 '邮编': '441300'},
						 '孝感市': {'下辖县级市':
									 ['安陆市', '应城市', '汉川市', '应城', '汉川', '安陆'],
										 '邮编': '432000'},
						 '咸宁市': {'下辖县级市':
									 ['赤壁', '赤壁市'],
										 '邮编': '437000'},
						 '襄阳': {'下辖县级市':
									 ['枣阳市', '宜城市', '老河口市', '枣阳', '宜城', '老河口'],
										 '邮编': '441000'}}},
			 '山西': {'下辖地级市':
						 {'大同': {'下辖县级市':
									 [],
										 '邮编': '037000'},
						 '临汾': {'下辖县级市':
									 ['霍州', '侯马市', '霍州市', '侯马'],
										 '邮编': '041000'},
						 '晋城': {'下辖县级市':
									 ['高平市', '高平'],
										 '邮编': '048000'},
						 '晋中市': {'下辖县级市':
									 ['介休市', '介休'],
										 '邮编': '038300'},
						 '忻州': {'下辖县级市':
									 ['原平市', '原平'],
										 '邮编': '034000'},
						 '朔州市': {'下辖县级市':
									 [],
										 '邮编': '038500'},
						 '忻州市': {'下辖县级市':
									 ['原平市', '原平'],
										 '邮编': '034000'},
						 '太原市': {'下辖县级市':
									 ['古交市', '古交'],
										 '邮编': '030000'},
						 '运城市': {'下辖县级市':
									 ['永济', '河津', '永济市', '河津市'],
										 '邮编': '044000'},
						 '长治': {'下辖县级市':
									 ['潞城市', '潞城'],
										 '邮编': '046000'},
						 '太原': {'下辖县级市':
									 ['古交市', '古交'],
										 '邮编': '030000'},
						 '晋中': {'下辖县级市':
									 ['介休市', '介休'],
										 '邮编': '038300'},
						 '长治市': {'下辖县级市':
									 ['潞城市', '潞城'],
										 '邮编': '046000'},
						 '阳泉': {'下辖县级市':
									 [],
										 '邮编': '045000'},
						 '朔州': {'下辖县级市':
									 [],
										 '邮编': '038500'},
						 '大同市': {'下辖县级市':
									 [],
										 '邮编': '037000'},
						 '吕梁': {'下辖县级市':
									 ['汾阳市', '孝义市', '孝义', '汾阳'],
										 '邮编': '033000'},
						 '临汾市': {'下辖县级市':
									 ['霍州', '侯马市', '霍州市', '侯马'],
										 '邮编': '041000'},
						 '晋城市': {'下辖县级市':
									 ['高平市', '高平'],
										 '邮编': '048000'},
						 '吕梁市': {'下辖县级市':
									 ['汾阳市', '孝义', '孝义市', '汾阳'],
										 '邮编': '033000'},
						 '运城': {'下辖县级市':
									 ['永济', '河津', '永济市', '河津市'],
										 '邮编': '044000'},
						 '阳泉市': {'下辖县级市':
									 [],
										 '邮编': '045000'}}},
			 '云南省': {'下辖地级市':
						 {'昭通市': {'下辖县级市':
									 [],
										 '邮编': '657000'},
						 '楚雄彝族自治州': {'下辖县级市':
										 ['楚雄市','楚雄'],
											 '邮编':'675000'},
						 '红河哈尼族彝族自治州': {'下辖县级市':
										 ['蒙自市','个旧市','开远市','弥勒市','蒙自','个旧','开远','弥勒'],
											 '邮编':'661400'},
						 '文山壮族苗族自治州': {'下辖县级市':
										 ['文山市','文山'],
											 '邮编':'663000'},
						 '西双版纳傣族自治州': {'下辖县级市':
										 ['景洪市','景洪'],
											 '邮编':'666100'},
						 '大理白族自治州': {'下辖县级市':
										 ['大理市','大理'],
											 '邮编':'671000'},
						 '德宏傣族景颇族自治州': {'下辖县级市':
										 ['芒市','瑞丽市','瑞丽'],
											 '邮编':'678400'},
						 '迪庆藏族自治州': {'下辖县级市':
										 ['香格里拉市','香格里拉'],
											 '邮编':'674400'},
						 '怒江傈僳族自治州': {'下辖县级市':
										 ['泸水市','泸水'],
											 '邮编':'673200'},
						 '楚雄': {'下辖县级市':
										 ['楚雄市','楚雄'],
											 '邮编':'675000'},
						 '红河': {'下辖县级市':
										 ['蒙自市','个旧市','开远市','弥勒市','蒙自','个旧','开远','弥勒'],
											 '邮编':'661400'},
						 '文山': {'下辖县级市':
										 ['文山市','文山'],
											 '邮编':'663000'},
						 '西双版纳': {'下辖县级市':
										 ['景洪市','景洪'],
											 '邮编':'666100'},
						 '大理': {'下辖县级市':
										 ['大理市','大理'],
											 '邮编':'671000'},
						 '德宏': {'下辖县级市':
										 ['芒市','瑞丽市','瑞丽'],
											 '邮编':'678400'},
						 '迪庆': {'下辖县级市':
										 ['香格里拉市','香格里拉'],
											 '邮编':'674400'},
						 '怒江': {'下辖县级市':
										 ['泸水市','泸水'],
											 '邮编':'673200'},
						 '昆明': {'下辖县级市':
									 ['安宁', '安宁市'],
										 '邮编': '650000'},
						 '临沧市': {'下辖县级市':
									 [],
										 '邮编': '677000'},
						 '普洱': {'下辖县级市':
									 [],
										 '邮编': '665000'},
						 '昆明市': {'下辖县级市':
									 ['安宁', '安宁市'],
										 '邮编': '650000'},
						 '保山市': {'下辖县级市':
									 ['腾冲市', '腾冲'],
										 '邮编': '678000'},
						 '曲靖': {'下辖县级市':
									 ['宣威', '宣威市'],
										 '邮编': '655000'},
						 '丽江': {'下辖县级市':
									 [],
										 '邮编': '674100'},
						 '丽江市': {'下辖县级市':
									 [],
										 '邮编': '674100'},
						 '玉溪': {'下辖县级市':
									 [],
										 '邮编': '653100'},
						 '临沧': {'下辖县级市':
									 [],
										 '邮编': '677000'},
						 '曲靖市': {'下辖县级市':
									 ['宣威', '宣威市'],
										 '邮编': '655000'},
						 '玉溪市': {'下辖县级市':
									 [],
										 '邮编': '653100'},
						 '普洱市': {'下辖县级市':
									 [],
										 '邮编': '665000'},
						 '保山': {'下辖县级市':
									 ['腾冲市', '腾冲'],
										 '邮编': '678000'},
						 '昭通': {'下辖县级市':
									 [],
										 '邮编': '657000'}}},
			 '北京市': {'下辖地级市':
						 {'北京市': {'下辖县级市':
									 ['北京市', '北京'],
										 '邮编': '100000'},
						 '北京': {'下辖县级市':
									 ['北京市', '北京'],
										 '邮编': '100000'}}},
			 '浙江省': {'下辖地级市':
						 {'舟山': {'下辖县级市':
									 [],
										 '邮编': '316000'},
						 '嘉兴市': {'下辖县级市':
									 ['桐乡', '海宁市', '平湖市', '桐乡市', '海宁', '平湖'],
										 '邮编': '314000'},
						 '衢州市': {'下辖县级市':
									 ['江山', '江山市'],
										 '邮编': '324000'},
						 '丽水': {'下辖县级市':
									 ['龙泉市', '龙泉'],
										 '邮编': '323000'},
						 '台州': {'下辖县级市':
									 ['温岭', '温岭市', '玉环', '临海市', '玉环市', '临海'],
										 '邮编': '318000'},
						 '绍兴市': {'下辖县级市':
									 ['诸暨', '诸暨市', '嵊州', '嵊州市'],
										 '邮编': '312000'},
						 '嘉兴': {'下辖县级市':
									 ['桐乡', '海宁市', '平湖市', '桐乡市', '海宁', '平湖'],
										 '邮编': '314000'},
						 '舟山市': {'下辖县级市':
									 [],
										 '邮编': '316000'},
						 '杭州': {'下辖县级市':
									 ['建德市', '建德', '临安市', '临安'],
										 '邮编': '310000'},
						 '湖州市': {'下辖县级市':
									 [],
										 '邮编': '313000'},
						 '金华市': {'下辖县级市':
									 ['永康市', '兰溪市', '永康', '兰溪', '东阳', '东阳市', '义乌', '义乌市'],
										 '邮编': '321000'},
						 '金华': {'下辖县级市':
									 ['永康市', '兰溪市', '永康', '兰溪', '东阳', '东阳市', '义乌', '义乌市'],
										 '邮编': '321000'},
						 '杭州市': {'下辖县级市':
									 ['建德市', '建德', '临安市', '临安'],
										 '邮编': '310000'},
						 '衢州': {'下辖县级市':
									 ['江山', '江山市'],
										 '邮编': '324000'},
						 '丽水市': {'下辖县级市':
									 ['龙泉市', '龙泉'],
										 '邮编': '323000'},
						 '宁波': {'下辖县级市':
									 ['慈溪', '余姚', '余姚市', '慈溪市'],
										 '邮编': '315000'},
						 '湖州': {'下辖县级市':
									 [],
										 '邮编': '313000'},
						 '宁波市': {'下辖县级市':
									 ['慈溪', '余姚', '余姚市', '慈溪市'],
										 '邮编': '315000'},
						 '温州': {'下辖县级市':
									 ['乐清市', '瑞安', '瑞安市', '乐清'],
										 '邮编': '325000'},
						 '绍兴': {'下辖县级市':
									 ['诸暨', '诸暨市', '嵊州', '嵊州市'],
										 '邮编': '312000'},
						 '温州市': {'下辖县级市':
									 ['瑞安', '乐清市', '瑞安市', '乐清'],
										 '邮编': '325000'},
						 '台州市': {'下辖县级市':
									 ['温岭', '温岭市', '玉环', '临海市', '临海', '玉环市'],
										 '邮编': '318000'}}},
			 '安徽': {'下辖地级市':
						 {'安庆': {'下辖县级市':
									 ['桐城', '桐城市'],
										 '邮编': '246000'},
						 '淮南': {'下辖县级市':
									 [],
										 '邮编': '232000'},
						 '池州': {'下辖县级市':
									 [],
										 '邮编': '247100'},
						 '池州市': {'下辖县级市':
									 [],
										 '邮编': '247100'},
						 '宿州': {'下辖县级市':
									 [],
										 '邮编': '234000'},
						 '淮北': {'下辖县级市':
									 [],
										 '邮编': '235000'},
						 '六安市': {'下辖县级市':
									 [],
										 '邮编': '237000'},
						 '滁州': {'下辖县级市':
									 ['明光', '天长市', '明光市', '天长'],
										 '邮编': '239000'},
						 '芜湖': {'下辖县级市':
									 [],
										 '邮编': '241000'},
						 '阜阳市': {'下辖县级市':
									 ['界首市', '界首'],
										 '邮编': '236000'},
						 '六安': {'下辖县级市':
									 [],
										 '邮编': '237000'},
						 '亳州': {'下辖县级市':
									 [],
										 '邮编': '236000'},
						 '马鞍山': {'下辖县级市':
									 [],
										 '邮编': '243000'},
						 '阜阳': {'下辖县级市':
									 ['界首市', '界首'],
										 '邮编': '236000'},
						 '芜湖市': {'下辖县级市':
									 [],
										 '邮编': '241000'},
						 '宣城': {'下辖县级市':
									 ['宁国市', '宁国'],
										 '邮编': '242000'},
						 '合肥': {'下辖县级市':
									 ['巢湖市', '巢湖'],
										 '邮编': '230000'},
						 '蚌埠': {'下辖县级市':
									 [],
										 '邮编': '233000'},
						 '淮南市': {'下辖县级市':
									 [],
										 '邮编': '232000'},
						 '安庆市': {'下辖县级市':
									 ['桐城', '桐城市'],
										 '邮编': '246000'},
						 '铜陵市': {'下辖县级市':
									 [],
										 '邮编': '244000'},
						 '蚌埠市': {'下辖县级市':
									 [],
										 '邮编': '233000'},
						 '合肥市': {'下辖县级市':
									 ['巢湖市', '巢湖'],
										 '邮编': '230000'},
						 '铜陵': {'下辖县级市':
									 [],
										 '邮编': '244000'},
						 '宣城市': {'下辖县级市':
									 ['宁国市', '宁国'],
										 '邮编': '242000'},
						 '马鞍山市': {'下辖县级市':
									 [],
										 '邮编': '243000'},
						 '亳州市': {'下辖县级市':
									 [],
										 '邮编': '236000'},
						 '淮北市': {'下辖县级市':
									 [],
										 '邮编': '235000'},
						 '黄山': {'下辖县级市':
									 [],
										 '邮编': '245000'},
						 '滁州市': {'下辖县级市':
									 ['明光', '天长市', '明光市', '天长'],
										 '邮编': '239000'},
						 '宿州市': {'下辖县级市':
									 [],
										 '邮编': '234000'},
						 '黄山市': {'下辖县级市':
									 [],
										 '邮编': '245000'}}},
			 '新疆维吾尔族自治区': {'下辖地级市':
						 {'乌鲁木齐': {'下辖县级市':
									 [],
										 '邮编': '830000'},
						 '塔城地区': {'下辖县级市':
										 ['塔城市','乌苏市','塔城','乌苏'],
											 '邮编':'834700'},
						 '阿勒泰地区': {'下辖县级市':
										 ['阿勒泰市','阿勒泰'],
											 '邮编':'836500'},
						 '阿克苏地区': {'下辖县级市':
										 ['阿克苏市','阿克苏'],
											 '邮编':'843000'},
						 '喀什地区': {'下辖县级市':
										 ['喀什市','喀什'],
											 '邮编':'844000'},
						 '和田地区': {'下辖县级市':
										 ['和田市','和田'],
											 '邮编':'848000'},
						 '昌吉回族自治州': {'下辖县级市':
										 ['昌吉市','阜康市','昌吉','阜康'],
											 '邮编':'831100'},
						 '博尔塔拉蒙古自治州': {'下辖县级市':
										 ['博乐市','阿拉山口市','博乐市','阿拉山口'],
											 '邮编':'833400'},
						 '伊犁哈萨克自治州': {'下辖县级市':
										 ['伊宁市','奎屯市','霍尔果斯市','伊宁','奎屯','霍尔果斯'],
											 '邮编':'835000'},
						 '巴音郭楞蒙古自治州': {'下辖县级市':
										 ['库尔勒市','库尔勒'],
											 '邮编':'841000'},
						 '克孜勒苏柯尔克孜自治州': {'下辖县级市':
										 ['阿图什市','阿图什'],
											 '邮编':'845350'},
						 '塔城': {'下辖县级市':
										 ['塔城市','乌苏市','塔城','乌苏'],
											 '邮编':'834700'},
						 '阿勒泰': {'下辖县级市':
										 ['阿勒泰市','阿勒泰'],
											 '邮编':'836500'},
						 '阿克苏': {'下辖县级市':
										 ['阿克苏市','阿克苏'],
											 '邮编':'843000'},
						 '喀什': {'下辖县级市':
										 ['喀什市','喀什'],
											 '邮编':'844000'},
						 '和田': {'下辖县级市':
										 ['和田市','和田'],
											 '邮编':'848000'},
						 '昌吉': {'下辖县级市':
										 ['昌吉市','阜康市','昌吉','阜康'],
											 '邮编':'831100'},
						 '博尔塔拉': {'下辖县级市':
										 ['博乐市','阿拉山口市','博乐市','阿拉山口'],
											 '邮编':'833400'},
						 '伊犁哈萨克': {'下辖县级市':
										 ['伊宁市','奎屯市','霍尔果斯市','伊宁','奎屯','霍尔果斯'],
											 '邮编':'835000'},
						 '巴音郭楞': {'下辖县级市':
										 ['库尔勒市','库尔勒'],
											 '邮编':'841000'},
						 '克孜勒苏柯尔克孜': {'下辖县级市':
										 ['阿图什市','阿图什'],
											 '邮编':'845350'},
						 '吐鲁番': {'下辖县级市':
									 [],
										 '邮编': '838000'},
						 '哈密': {'下辖县级市':
									 [],
										 '邮编': '839000'},
						 '克拉玛依市': {'下辖县级市':
									 [],
										 '邮编': '834000'},
						 '乌鲁木齐市': {'下辖县级市':
									 [],
										 '邮编': '830000'},
						 '克拉玛依': {'下辖县级市':
									 [],
										 '邮编': '834000'},
						 '哈密市': {'下辖县级市':
									 [],
										 '邮编': '839000'},
						 '吐鲁番市': {'下辖县级市':
									 [],
										 '邮编': '838000'}}},
			 '四川': {'下辖地级市':
						 {'广安': {'下辖县级市':
									 ['华蓥', '华蓥市'],
										 '邮编': '638500'},
						 '凉山彝族自治州': {'下辖县级市':
										 ['西昌市','西昌'],
											 '邮编':'615000'},
						 '甘孜藏族自治州': {'下辖县级市':
										 ['康定市','康定'],
											 '邮编':'626000'},
						 '阿坝藏族羌族自治州': {'下辖县级市':
										 ['马尔康市','马尔康'],
										 	 '邮编':'624000'},
						 '凉山': {'下辖县级市':
										 ['西昌市','西昌'],
											 '邮编':'615000'},
						 '甘孜': {'下辖县级市':
										 ['康定市','康定'],
											 '邮编':'626000'},
						 '阿坝': {'下辖县级市':
										 ['马尔康市','马尔康'],
										 	 '邮编':'624000'},
						 '泸州市': {'下辖县级市':
									 [],
										 '邮编': '646000'},
						 '巴中市': {'下辖县级市':
									 [],
										 '邮编': '636600'},
						 '达州': {'下辖县级市':
									 ['万源', '万源市'],
										 '邮编': '635000'},
						 '资阳': {'下辖县级市':
									 [],
										 '邮编': '641300'},
						 '内江市': {'下辖县级市':
									 ['隆昌', '隆昌市'],
										 '邮编': '641000'},
						 '成都市': {'下辖县级市':
									 ['都江堰', '邛崃市', '简阳市', '彭州', '都江堰市', '简阳', '彭州市', '崇州市', '邛崃', '崇州'],
										 '邮编': '610000'},
						 '攀枝花市': {'下辖县级市':
									 [],
										 '邮编': '617000'},
						 '达州市': {'下辖县级市':
									 ['万源', '万源市'],
										 '邮编': '635000'},
						 '遂宁市': {'下辖县级市':
									 [],
										 '邮编': '629000'},
						 '乐山市': {'下辖县级市':
									 ['峨眉山市', '峨眉山'],
										 '邮编': '614000'},
						 '绵阳': {'下辖县级市':
									 ['江油', '江油市'],
										 '邮编': '621000'},
						 '雅安市': {'下辖县级市':
									 [],
										 '邮编': '625000'},
						 '内江': {'下辖县级市':
									 ['隆昌', '隆昌市'],
										 '邮编': '641000'},
						 '成都': {'下辖县级市':
									 ['都江堰', '邛崃市', '简阳市', '彭州', '都江堰市', '简阳', '彭州市', '邛崃', '崇州', '崇州市'],
										 '邮编': '610000'},
						 '遂宁': {'下辖县级市':
									 [],
										 '邮编': '629000'},
						 '宜宾': {'下辖县级市':
									 [],
										 '邮编': '644000'},
						 '南充市': {'下辖县级市':
									 ['阆中市', '阆中'],
										 '邮编': '637000'},
						 '绵阳市': {'下辖县级市':
									 ['江油', '江油市'],
										 '邮编': '621000'},
						 '德阳市': {'下辖县级市':
									 ['绵竹市', '广汉', '广汉市', '什邡', '什邡市', '绵竹'],
										 '邮编': '618000'},
						 '自贡市': {'下辖县级市':
									 [],
										 '邮编': '643000'},
						 '巴中': {'下辖县级市':
									 [],
										 '邮编': '636600'},
						 '乐山': {'下辖县级市':
									 ['峨眉山市', '峨眉山'],
										 '邮编': '614000'},
						 '宜宾市': {'下辖县级市':
									 [],
										 '邮编': '644000'},
						 '广元市': {'下辖县级市':
									 [],
										 '邮编': '628000'},
						 '广安市': {'下辖县级市':
									 ['华蓥', '华蓥市'],
										 '邮编': '638500'},
						 '泸州': {'下辖县级市':
									 [],
										 '邮编': '646000'},
						 '雅安': {'下辖县级市':
									 [],
										 '邮编': '625000'},
						 '攀枝花': {'下辖县级市':
									 [],
										 '邮编': '617000'},
						 '德阳': {'下辖县级市':
									 ['绵竹市', '广汉市', '广汉', '什邡市', '什邡', '绵竹'],
										 '邮编': '618000'},
						 '南充': {'下辖县级市':
									 ['阆中市', '阆中'],
										 '邮编': '637000'},
						 '峨眉山市': {'下辖县级市':
									 [],
										 '邮编': '614200'},
						 '自贡': {'下辖县级市':
									 [],
										 '邮编': '643000'},
						 '峨眉山': {'下辖县级市':
									 [],
										 '邮编': '614200'},
						 '广元': {'下辖县级市':
									 [],
										 '邮编': '628000'},
						 '资阳市': {'下辖县级市':
									 [],
										 '邮编': '641300'}}},
			 '贵州省': {'下辖地级市':
						 {'六盘水市': {'下辖县级市':
									 ['盘州', '盘州市'],
										 '邮编': '553000'},
						 '黔西南布依族苗族自治州': {'下辖县级市':
										 ['兴义市','兴义'],
											 '邮编':'562400'},
						 '黔东南苗族侗族自治州': {'下辖县级市':
										 ['凯里市','凯里'],
											 '邮编':'556000'},
						 '黔南布依族苗族自治州': {'下辖县级市':
										 ['都匀市','福泉市','都匀','福泉'],
											 '邮编':'558000'},
						 '黔西南': {'下辖县级市':
										 ['兴义市','兴义'],
											 '邮编':'562400'},
						 '黔东南': {'下辖县级市':
										 ['凯里市','凯里'],
											 '邮编':'556000'},
						 '黔南': {'下辖县级市':
										 ['都匀市','福泉市','都匀','福泉'],
											 '邮编':'558000'},
						 '贵阳市': {'下辖县级市':
									 ['清镇', '清镇市'],
										 '邮编': '550000'},
						 '安顺市': {'下辖县级市':
									 [],
										 '邮编': '561000'},
						 '安顺': {'下辖县级市':
									 [],
										 '邮编': '561000'},
						 '毕节市': {'下辖县级市':
									 [],
										 '邮编': '551700'},
						 '遵义': {'下辖县级市':
									 ['赤水市', '赤水', '仁怀市', '仁怀'],
										 '邮编': '563000'},
						 '铜仁市': {'下辖县级市':
									 [],
										 '邮编': '554300'},
						 '铜仁': {'下辖县级市':
									 [],
										 '邮编': '554300'},
						 '遵义市': {'下辖县级市':
									 ['赤水市', '仁怀市', '仁怀', '赤水'],
										 '邮编': '563000'},
						 '贵阳': {'下辖县级市':
									 ['清镇', '清镇市'],
										 '邮编': '550000'},
						 '毕节': {'下辖县级市':
									 [],
										 '邮编': '551700'},
						 '六盘水': {'下辖县级市':
									 ['盘州', '盘州市'],
										 '邮编': '553000'}}},
			 '四川省': {'下辖地级市':
						 {'达州市': {'下辖县级市':
									 ['万源', '万源市'],
										 '邮编': '635000'},
						 '凉山彝族自治州': {'下辖县级市':
										 ['西昌市','西昌'],
											 '邮编':'615000'},
						 '甘孜藏族自治州': {'下辖县级市':
										 ['康定市','康定'],
											 '邮编':'626000'},
						 '阿坝藏族羌族自治州': {'下辖县级市':
										 ['马尔康市','马尔康'],
										 	 '邮编':'624000'},
						 '凉山': {'下辖县级市':
										 ['西昌市','西昌'],
											 '邮编':'615000'},
						 '甘孜': {'下辖县级市':
										 ['康定市','康定'],
											 '邮编':'626000'},
						 '阿坝': {'下辖县级市':
										 ['马尔康市','马尔康'],
										 	 '邮编':'624000'},
						 '泸州市': {'下辖县级市':
									 [],
										 '邮编': '646000'},
						 '自贡': {'下辖县级市':
									 [],
										 '邮编': '643000'},
						 '达州': {'下辖县级市':
									 ['万源', '万源市'],
										 '邮编': '635000'},
						 '广安市': {'下辖县级市':
									 ['华蓥', '华蓥市'],
										 '邮编': '638500'},
						 '内江市': {'下辖县级市':
									 ['隆昌', '隆昌市'],
										 '邮编': '641000'},
						 '成都市': {'下辖县级市':
									 ['都江堰', '邛崃市', '简阳市', '彭州', '都江堰市', '简阳', '彭州市', '崇州市', '邛崃', '崇州'],
										 '邮编': '610000'},
						 '攀枝花市': {'下辖县级市':
									 [],
										 '邮编': '617000'},
						 '广安': {'下辖县级市':
									 ['华蓥', '华蓥市'],
										 '邮编': '638500'},
						 '遂宁市': {'下辖县级市':
									 [],
										 '邮编': '629000'},
						 '遂宁': {'下辖县级市':
									 [],
										 '邮编': '629000'},
						 '绵阳': {'下辖县级市':
									 ['江油', '江油市'],
										 '邮编': '621000'},
						 '雅安市': {'下辖县级市':
									 [],
										 '邮编': '625000'},
						 '内江': {'下辖县级市':
									 ['隆昌', '隆昌市'],
										 '邮编': '641000'},
						 '成都': {'下辖县级市':
									 ['都江堰', '邛崃市', '简阳市', '彭州', '都江堰市', '简阳', '彭州市', '邛崃', '崇州', '崇州市'],
										 '邮编': '610000'},
						 '乐山市': {'下辖县级市':
									 ['峨眉山市', '峨眉山'],
										 '邮编': '614000'},
						 '宜宾': {'下辖县级市':
									 [],
										 '邮编': '644000'},
						 '广元': {'下辖县级市':
									 [],
										 '邮编': '628000'},
						 '资阳': {'下辖县级市':
									 [],
										 '邮编': '641300'},
						 '南充市': {'下辖县级市':
									 ['阆中市', '阆中'],
										 '邮编': '637000'},
						 '自贡市': {'下辖县级市':
									 [],
										 '邮编': '643000'},
						 '巴中': {'下辖县级市':
									 [],
										 '邮编': '636600'},
						 '德阳市': {'下辖县级市':
									 ['绵竹市', '广汉', '广汉市', '什邡', '什邡市', '绵竹'],
										 '邮编': '618000'},
						 '宜宾市': {'下辖县级市':
									 [],
										 '邮编': '644000'},
						 '乐山': {'下辖县级市':
									 ['峨眉山市', '峨眉山'],
										 '邮编': '614000'},
						 '巴中市': {'下辖县级市':
									 [],
										 '邮编': '636600'},
						 '泸州': {'下辖县级市':
									 [],
										 '邮编': '646000'},
						 '雅安': {'下辖县级市':
									 [],
										 '邮编': '625000'},
						 '攀枝花': {'下辖县级市':
									 [],
										 '邮编': '617000'},
						 '德阳': {'下辖县级市':
									 ['绵竹市', '广汉市', '广汉', '什邡市', '什邡', '绵竹'],
										 '邮编': '618000'},
						 '南充': {'下辖县级市':
									 ['阆中市', '阆中'],
										 '邮编': '637000'},
						 '峨眉山市': {'下辖县级市':
									 [],
										 '邮编': '614200'},
						 '绵阳市': {'下辖县级市':
									 ['江油', '江油市'],
										 '邮编': '621000'},
						 '峨眉山': {'下辖县级市':
									 [],
										 '邮编': '614200'},
						 '广元市': {'下辖县级市':
									 [],
										 '邮编': '628000'},
						 '资阳市': {'下辖县级市':
									 [],
										 '邮编': '641300'}}},
			 '重庆': {'下辖地级市':
						 {'重庆市': {'下辖县级市':
									 ['重庆市', '重庆'],
										 '邮编': '400000'},
						 '重庆': {'下辖县级市':
									 ['重庆市', '重庆'],
										 '邮编': '400000'}}},
			 '陕西': {'下辖地级市':
						 {'铜川': {'下辖县级市':
									 [],
										 '邮编': '727000'},
						 '安康': {'下辖县级市':
									 [],
										 '邮编': '725000'},
						 '延安': {'下辖县级市':
									 [],
										 '邮编': '716000'},
						 '汉中市': {'下辖县级市':
									 [],
										 '邮编': '723000'},
						 '咸阳': {'下辖县级市':
									 ['兴平', '兴平市'],
										 '邮编': '712000'},
						 '宝鸡': {'下辖县级市':
									 [],
										 '邮编': '721000'},
						 '榆林市': {'下辖县级市':
									 ['神木', '神木市'],
										 '邮编': '719000'},
						 '安康市': {'下辖县级市':
									 [],
										 '邮编': '725000'},
						 '西安': {'下辖县级市':
									 [],
										 '邮编': '710000'},
						 '铜川市': {'下辖县级市':
									 [],
										 '邮编': '727000'},
						 '榆林': {'下辖县级市':
									 ['神木', '神木市'],
										 '邮编': '719000'},
						 '商洛': {'下辖县级市':
									 [],
										 '邮编': '726000'},
						 '西安市': {'下辖县级市':
									 [],
										 '邮编': '710000'},
						 '延安市': {'下辖县级市':
									 [],
										 '邮编': '716000'},
						 '渭南': {'下辖县级市':
									 ['韩城', '华阴', '华阴市', '韩城市'],
										 '邮编': '714000'},
						 '商洛市': {'下辖县级市':
									 [],
										 '邮编': '726000'},
						 '咸阳市': {'下辖县级市':
									 ['兴平', '兴平市'],
										 '邮编': '712000'},
						 '宝鸡市': {'下辖县级市':
									 [],
										 '邮编': '721000'},
						 '汉中': {'下辖县级市':
									 [],
										 '邮编': '723000'},
						 '渭南市': {'下辖县级市':
									 ['韩城', '华阴', '华阴市', '韩城市'],
										 '邮编': '714000'}}},
			 '海南': {'下辖地级市':
						 {'儋州': {'下辖县级市':
									 [],
										 '邮编': '571700'},
						 '儋州市': {'下辖县级市':
									 [],
										 '邮编': '571700'},
						 '三亚市': {'下辖县级市':
									 [],
										 '邮编': '572000'},
						 '三亚': {'下辖县级市':
									 [],
										 '邮编': '572000'},
						 '海口市': {'下辖县级市':
									 [],
										 '邮编': '570100'},
						 '三沙': {'下辖县级市':
									 [],
										 '邮编': '573199'},
						 '海口': {'下辖县级市':
									 [],
										 '邮编': '570100'},
						 '三沙市': {'下辖县级市':
									 [],
										 '邮编': '573199'}}},
			 '西藏自治区': {'下辖地级市':
						 {'林芝市': {'下辖县级市':
									 [],
										 '邮编': '860000'},
						 '昌都': {'下辖县级市':
									 [],
										 '邮编': '854000'},
						 '拉萨市': {'下辖县级市':
									 [],
										 '邮编': '850000'},
						 '山南': {'下辖县级市':
									 [],
										 '邮编': '856000'},
						 '林芝': {'下辖县级市':
									 [],
										 '邮编': '860000'},
						 '昌都市': {'下辖县级市':
									 [],
										 '邮编': '854000'},
						 '拉萨': {'下辖县级市':
									 [],
										 '邮编': '850000'},
						 '日喀则市': {'下辖县级市':
									 [],
										 '邮编': '857000'},
						 '日喀则': {'下辖县级市':
									 [],
										 '邮编': '857000'},
						 '山南市': {'下辖县级市':
									 [],
										 '邮编': '856000'}}},
			 '福建': {'下辖地级市':
						 {'漳州市': {'下辖县级市':
									 ['龙海市', '龙海'],
										 '邮编': '363000'},
						 '宁德': {'下辖县级市':
									 ['福安市', '福鼎市', '福鼎', '福安'],
										 '邮编': '352000'},
						 '南平市': {'下辖县级市':
									 ['武夷山市', '武夷山', '邵武', '建瓯市', '邵武市', '建瓯'],
										 '邮编': '353000'},
						 '泉州': {'下辖县级市':
									 ['南安市', '石狮', '南安', '晋江', '晋江市', '石狮市'],
										 '邮编': '362000'},
						 '三明': {'下辖县级市':
									 ['永安', '永安市'],
										 '邮编': '365000'},
						 '漳州': {'下辖县级市':
									 ['龙海市', '龙海'],
										 '邮编': '363000'},
						 '莆田市': {'下辖县级市':
									 [],
										 '邮编': '351100'},
						 '龙岩': {'下辖县级市':
									 ['漳平', '漳平市'],
										 '邮编': '364000'},
						 '宁德市': {'下辖县级市':
									 ['福安市', '福鼎市', '福鼎', '福安'],
										 '邮编': '352000'},
						 '南平': {'下辖县级市':
									 ['武夷山市', '武夷山', '邵武', '建瓯市', '邵武市', '建瓯'],
										 '邮编': '353000'},
						 '厦门': {'下辖县级市':
									 [],
										 '邮编': '361000'},
						 '福州市': {'下辖县级市':
									 ['福清', '长乐市', '长乐', '福清市'],
										 '邮编': '350000'},
						 '福州': {'下辖县级市':
									 ['福清', '福清市', '长乐市', '长乐'],
										 '邮编': '350000'},
						 '莆田': {'下辖县级市':
									 [],
										 '邮编': '351100'},
						 '龙岩市': {'下辖县级市':
									 ['漳平', '漳平市'],
										 '邮编': '364000'},
						 '三明市': {'下辖县级市':
									 ['永安', '永安市'],
										 '邮编': '365000'},
						 '泉州市': {'下辖县级市':
									 ['南安市', '石狮', '南安', '晋江', '晋江市', '石狮市'],
										 '邮编': '362000'},
						 '厦门市': {'下辖县级市':
									 [],
										 '邮编': '361000'}}},
			 '上海': {'下辖地级市':
						 {'上海': {'下辖县级市':
									 ['上海市', '上海'],
										 '邮编': '200000'},
						 '上海市': {'下辖县级市':
									 ['上海市', '上海'],
										 '邮编': '200000'}}},
			 '贵州': {'下辖地级市':
						 {'六盘水市': {'下辖县级市':
									 ['盘州', '盘州市'],
										 '邮编': '553000'},
						 '黔西南布依族苗族自治州': {'下辖县级市':
										 ['兴义市','兴义'],
											 '邮编':'562400'},
						 '黔东南苗族侗族自治州': {'下辖县级市':
										 ['凯里市','凯里'],
											 '邮编':'556000'},
						 '黔南布依族苗族自治州': {'下辖县级市':
										 ['都匀市','福泉市','都匀','福泉'],
											 '邮编':'558000'},
						 '黔西南': {'下辖县级市':
										 ['兴义市','兴义'],
											 '邮编':'562400'},
						 '黔东南': {'下辖县级市':
										 ['凯里市','凯里'],
											 '邮编':'556000'},
						 '黔南': {'下辖县级市':
										 ['都匀市','福泉市','都匀','福泉'],
											 '邮编':'558000'},
						 '贵阳': {'下辖县级市':
									 ['清镇', '清镇市'],
										 '邮编': '550000'},
						 '毕节': {'下辖县级市':
									 [],
										 '邮编': '551700'},
						 '安顺': {'下辖县级市':
									 [],
										 '邮编': '561000'},
						 '毕节市': {'下辖县级市':
									 [],
										 '邮编': '551700'},
						 '遵义': {'下辖县级市':
									 ['赤水市', '赤水', '仁怀市', '仁怀'],
										 '邮编': '563000'},
						 '铜仁市': {'下辖县级市':
									 [],
										 '邮编': '554300'},
						 '遵义市': {'下辖县级市':
									 ['赤水市', '仁怀市', '仁怀', '赤水'],
										 '邮编': '563000'},
						 '铜仁': {'下辖县级市':
									 [],
										 '邮编': '554300'},
						 '安顺市': {'下辖县级市':
									 [],
										 '邮编': '561000'},
						 '贵阳市': {'下辖县级市':
									 ['清镇', '清镇市'],
										 '邮编': '550000'},
						 '六盘水': {'下辖县级市':
									 ['盘州', '盘州市'],
										 '邮编': '553000'}}},
			 '西藏': {'下辖地级市':
						 {'林芝市': {'下辖县级市':
									 [],
										 '邮编': '860000'},
						 '昌都': {'下辖县级市':
									 [],
										 '邮编': '854000'},
						 '拉萨市': {'下辖县级市':
									 [],
										 '邮编': '850000'},
						 '山南': {'下辖县级市':
									 [],
										 '邮编': '856000'},
						 '林芝': {'下辖县级市':
									 [],
										 '邮编': '860000'},
						 '昌都市': {'下辖县级市':
									 [],
										 '邮编': '854000'},
						 '拉萨': {'下辖县级市':
									 [],
										 '邮编': '850000'},
						 '日喀则市': {'下辖县级市':
									 [],
										 '邮编': '857000'},
						 '日喀则': {'下辖县级市':
									 [],
										 '邮编': '857000'},
						 '山南市': {'下辖县级市':
									 [],
										 '邮编': '856000'}}},
			 '重庆市': {'下辖地级市':
						 {'重庆市': {'下辖县级市':
									 ['重庆市', '重庆'],
										 '邮编': '400000'},
						 '重庆': {'下辖县级市':
									 ['重庆市', '重庆'],
										 '邮编': '400000'}}},
			 '辽宁': {'下辖地级市':
						 {'本溪市': {'下辖县级市':
									 [],
										 '邮编': '117000'},
						 '抚顺市': {'下辖县级市':
									 [],
										 '邮编': '113000'},
						 '本溪': {'下辖县级市':
									 [],
										 '邮编': '117000'},
						 '锦州市': {'下辖县级市':
									 ['凌海', '北镇', '凌海市', '北镇市'],
										 '邮编': '121000'},
						 '锦州': {'下辖县级市':
									 ['北镇', '凌海市', '凌海', '北镇市'],
										 '邮编': '121000'},
						 '盘锦市': {'下辖县级市':
									 [],
										 '邮编': '124000'},
						 '盘锦': {'下辖县级市':
									 [],
										 '邮编': '124000'},
						 '阜新': {'下辖县级市':
									 [],
										 '邮编': '123000'},
						 '丹东市': {'下辖县级市':
									 ['凤城市', '东港', '凤城', '东港市'],
										 '邮编': '118000'},
						 '铁岭市': {'下辖县级市':
									 ['调兵山市', '调兵山', '开原市', '开原'],
										 '邮编': '112000'},
						 '葫芦岛市': {'下辖县级市':
									 ['兴城市', '兴城'],
										 '邮编': '125000'},
						 '大连市': {'下辖县级市':
									 ['庄河', '瓦房店', '庄河市', '瓦房店市'],
										 '邮编': '116000'},
						 '沈阳市': {'下辖县级市':
									 ['新民市', '新民'],
										 '邮编': '110000'},
						 '辽阳市': {'下辖县级市':
									 ['灯塔', '灯塔市'],
										 '邮编': '111000'},
						 '铁岭': {'下辖县级市':
									 ['调兵山', '开原市', '开原', '调兵山市'],
										 '邮编': '112000'},
						 '抚顺': {'下辖县级市':
									 [],
										 '邮编': '113000'},
						 '辽阳': {'下辖县级市':
									 ['灯塔', '灯塔市'],
										 '邮编': '111000'},
						 '鞍山': {'下辖县级市':
									 ['海城', '海城市'],
										 '邮编': '114000'},
						 '鞍山市': {'下辖县级市':
									 ['海城', '海城市'],
										 '邮编': '114000'},
						 '营口市': {'下辖县级市':
									 ['盖州市', '盖州', '大石桥', '大石桥市'],
										 '邮编': '115000'},
						 '大连': {'下辖县级市':
									 ['庄河', '瓦房店', '庄河市', '瓦房店市'],
										 '邮编': '116000'},
						 '沈阳': {'下辖县级市':
									 ['新民市', '新民'],
										 '邮编': '110000'},
						 '阜新市': {'下辖县级市':
									 [],
										 '邮编': '123000'},
						 '营口': {'下辖县级市':
									 ['大石桥市', '大石桥', '盖州市', '盖州'],
										 '邮编': '115000'},
						 '葫芦岛': {'下辖县级市':
									 ['兴城', '兴城市'],
										 '邮编': '125000'},
						 '丹东': {'下辖县级市':
									 ['凤城市', '东港', '凤城', '东港市'],
										 '邮编': '118000'}}},
			 '湖南省': {'下辖地级市':
						 {'湘潭': {'下辖县级市':
									 ['湘乡', '湘乡市', '韶山', '韶山市'],
										 '邮编': '411100'},
						 '娄底': {'下辖县级市':
									 ['冷水江', '冷水江市', '涟源', '涟源市'],
										 '邮编': '417000'},
						 '湘潭市': {'下辖县级市':
									 ['韶山', '湘乡', '湘乡市', '韶山市'],
										 '邮编': '411100'},
						 '益阳市': {'下辖县级市':
									 ['沅江市', '沅江'],
										 '邮编': '413000'},
						 '衡阳市': {'下辖县级市':
									 ['常宁市', '耒阳', '常宁', '耒阳市'],
										 '邮编': '421000'},
						 '常德市': {'下辖县级市':
									 ['津市市','津市'],
										 '邮编': '415000'},
						 '常德': {'下辖县级市':
									 ['津市','津市市'],
										 '邮编': '415000'},
						 '岳阳': {'下辖县级市':
									 ['临湘', '汨罗', '汨罗市', '临湘市'],
										 '邮编': '414000'},
						 '怀化市': {'下辖县级市':
									 ['洪江市', '洪江'],
										 '邮编': '418000'},
						 '张家界': {'下辖县级市':
									 [],
										 '邮编': '427000'},
						 '湘西土家族苗族自治州': {'下辖县级市':
									 ['吉首市','吉首'],
										 '邮编': '416000'},
						 '永州市': {'下辖县级市':
									 [],
										 '邮编': '425000'},
						 '怀化': {'下辖县级市':
									 ['洪江市', '洪江'],
										 '邮编': '418000'},
						 '邵阳': {'下辖县级市':
									 ['武冈市', '武冈'],
										 '邮编': '422000'},
						 '益阳': {'下辖县级市':
									 ['沅江市', '沅江'],
										 '邮编': '413000'},
						 '张家界市': {'下辖县级市':
									 [],
										 '邮编': '427000'},
						 '郴州': {'下辖县级市':
									 ['资兴市', '资兴'],
										 '邮编': '423000'},
						 '岳阳市': {'下辖县级市':
									 ['临湘', '汨罗市', '汨罗', '临湘市'],
										 '邮编': '414000'},
						 '衡阳': {'下辖县级市':
									 ['常宁市', '耒阳', '常宁', '耒阳市'],
										 '邮编': '421000'},
						 '永州': {'下辖县级市':
									 [],
										 '邮编': '425000'},
						 '郴州市': {'下辖县级市':
									 ['资兴市', '资兴'],
										 '邮编': '423000'},
						 '株洲': {'下辖县级市':
									 ['醴陵市', '醴陵'],
										 '邮编': '412000'},
						 '娄底市': {'下辖县级市':
									 ['冷水江', '冷水江市', '涟源', '涟源市'],
										 '邮编': '417000'},
						 '邵阳市': {'下辖县级市':
									 ['武冈市', '武冈'],
										 '邮编': '422000'},
						 '长沙': {'下辖县级市':
									 ['宁乡', '浏阳市', '宁乡市', '浏阳'],
										 '邮编': '410000'},
						 '株洲市': {'下辖县级市':
									 ['醴陵市', '醴陵'],
										 '邮编': '412000'},
						 '长沙市': {'下辖县级市':
									 ['宁乡', '浏阳市', '宁乡市', '浏阳'],
										 '邮编': '410000'}}},
			 '甘肃省': {'下辖地级市':
						 {'嘉峪关市': {'下辖县级市':
									 [],
										 '邮编': '735100'},
						 '临夏回族自治州': {'下辖县级市':
										 ['临夏市','临夏'],
											 '邮编':'731100'},
						 '甘南藏族自治州': {'下辖县级市':
										 ['合作市','合作'],
											 '邮编':'747000'},
						 '临夏': {'下辖县级市':
										 ['临夏市','临夏'],
											 '邮编':'731100'},
						 '甘南': {'下辖县级市':
										 ['合作市','合作'],
											 '邮编':'747000'},
						 '定西市': {'下辖县级市':
									 [],
										 '邮编': '743000'},
						 '平凉': {'下辖县级市':
									 [],
										 '邮编': '744000'},
						 '白银市': {'下辖县级市':
									 [],
										 '邮编': '730900'},
						 '张掖市': {'下辖县级市':
									 [],
										 '邮编': '734000'},
						 '白银': {'下辖县级市':
									 [],
										 '邮编': '730900'},
						 '张掖': {'下辖县级市':
									 [],
										 '邮编': '734000'},
						 '金昌市': {'下辖县级市':
									 [],
										 '邮编': '737100'},
						 '武威': {'下辖县级市':
									 [],
										 '邮编': '733000'},
						 '庆阳市': {'下辖县级市':
									 [],
										 '邮编': '745000'},
						 '金昌': {'下辖县级市':
									 [],
										 '邮编': '737100'},
						 '庆阳': {'下辖县级市':
									 [],
										 '邮编': '745000'},
						 '酒泉市': {'下辖县级市':
									 ['敦煌', '敦煌市', '玉门市', '玉门'],
										 '邮编': '735000'},
						 '天水市': {'下辖县级市':
									 [],
										 '邮编': '741000'},
						 '武威市': {'下辖县级市':
									 [],
										 '邮编': '733000'},
						 '平凉市': {'下辖县级市':
									 [],
										 '邮编': '744000'},
						 '天水': {'下辖县级市':
									 [],
										 '邮编': '741000'},
						 '嘉峪关': {'下辖县级市':
									 [],
										 '邮编': '735100'},
						 '陇南市': {'下辖县级市':
									 [],
										 '邮编': '742500'},
						 '兰州': {'下辖县级市':
									 [],
										 '邮编': '730000'},
						 '陇南': {'下辖县级市':
									 [],
										 '邮编': '742500'},
						 '兰州市': {'下辖县级市':
									 [],
										 '邮编': '730000'},
						 '酒泉': {'下辖县级市':
									 ['敦煌', '敦煌市', '玉门市', '玉门'],
										 '邮编': '735000'},
						 '定西': {'下辖县级市':
									 [],
										 '邮编': '743000'}}},
			 '甘肃': {'下辖地级市':
						 {'嘉峪关市': {'下辖县级市':
									 [],
										 '邮编': '735100'},
						 '临夏回族自治州': {'下辖县级市':
										 ['临夏市','临夏'],
											 '邮编':'731100'},
						 '甘南藏族自治州': {'下辖县级市':
										 ['合作市','合作'],
											 '邮编':'747000'},
						 '临夏': {'下辖县级市':
										 ['临夏市','临夏'],
											 '邮编':'731100'},
						 '甘南': {'下辖县级市':
										 ['合作市','合作'],
											 '邮编':'747000'},
						 '庆阳': {'下辖县级市':
									 [],
										 '邮编': '745000'},
						 '平凉': {'下辖县级市':
									 [],
										 '邮编': '744000'},
						 '白银市': {'下辖县级市':
									 [],
										 '邮编': '730900'},
						 '张掖市': {'下辖县级市':
									 [],
										 '邮编': '734000'},
						 '白银': {'下辖县级市':
									 [],
										 '邮编': '730900'},
						 '张掖': {'下辖县级市':
									 [],
										 '邮编': '734000'},
						 '金昌市': {'下辖县级市':
									 [],
										 '邮编': '737100'},
						 '武威': {'下辖县级市':
									 [],
										 '邮编': '733000'},
						 '庆阳市': {'下辖县级市':
									 [],
										 '邮编': '745000'},
						 '金昌': {'下辖县级市':
									 [],
										 '邮编': '737100'},
						 '定西市': {'下辖县级市':
									 [],
										 '邮编': '743000'},
						 '酒泉市': {'下辖县级市':
									 ['敦煌', '敦煌市', '玉门市', '玉门'],
										 '邮编': '735000'},
						 '天水市': {'下辖县级市':
									 [],
										 '邮编': '741000'},
						 '武威市': {'下辖县级市':
									 [],
										 '邮编': '733000'},
						 '平凉市': {'下辖县级市':
									 [],
										 '邮编': '744000'},
						 '酒泉': {'下辖县级市':
									 ['敦煌', '敦煌市', '玉门市', '玉门'],
										 '邮编': '735000'},
						 '嘉峪关': {'下辖县级市':
									 [],
										 '邮编': '735100'},
						 '陇南市': {'下辖县级市':
									 [],
										 '邮编': '742500'},
						 '兰州': {'下辖县级市':
									 [],
										 '邮编': '730000'},
						 '陇南': {'下辖县级市':
									 [],
										 '邮编': '742500'},
						 '兰州市': {'下辖县级市':
									 [],
										 '邮编': '730000'},
						 '天水': {'下辖县级市':
									 [],
										 '邮编': '741000'},
						 '定西': {'下辖县级市':
									 [],
										 '邮编': '743000'}}},
			 '广西壮族自治区': {'下辖地级市':
						 {'贵港': {'下辖县级市':
									 ['桂平市', '桂平'],
										 '邮编': '537000'},
						 '桂林': {'下辖县级市':
									 [],
										 '邮编': '541000'},
						 '南宁市': {'下辖县级市':
									 [],
										 '邮编': '530000'},
						 '防城港': {'下辖县级市':
									 ['东兴', '东兴市'],
										 '邮编': '538000'},
						 '来宾市': {'下辖县级市':
									 ['合山市', '合山'],
										 '邮编': '546100'},
						 '贵港市': {'下辖县级市':
									 ['桂平市', '桂平'],
										 '邮编': '537000'},
						 '贺州': {'下辖县级市':
									 [],
										 '邮编': '542800'},
						 '崇左市': {'下辖县级市':
									 ['凭祥市', '凭祥'],
										 '邮编': '532200'},
						 '玉林市': {'下辖县级市':
									 ['北流', '北流市'],
										 '邮编': '537000'},
						 '柳州市': {'下辖县级市':
									 [],
										 '邮编': '545000'},
						 '南宁': {'下辖县级市':
									 [],
										 '邮编': '530000'},
						 '河池': {'下辖县级市':
									 [],
										 '邮编': '547000'},
						 '钦州': {'下辖县级市':
									 [],
										 '邮编': '535000'},
						 '桂林市': {'下辖县级市':
									 [],
										 '邮编': '541000'},
						 '北海市': {'下辖县级市':
									 [],
										 '邮编': '536000'},
						 '柳州': {'下辖县级市':
									 [],
										 '邮编': '545000'},
						 '钦州市': {'下辖县级市':
									 [],
										 '邮编': '535000'},
						 '梧州市': {'下辖县级市':
									 ['岑溪市', '岑溪'],
										 '邮编': '543000'},
						 '百色': {'下辖县级市':
									 ['靖西市', '靖西'],
										 '邮编': '533000'},
						 '河池市': {'下辖县级市':
									 [],
										 '邮编': '547000'},
						 '崇左': {'下辖县级市':
									 ['凭祥市', '凭祥'],
										 '邮编': '532200'},
						 '贺州市': {'下辖县级市':
									 [],
										 '邮编': '542800'},
						 '北海': {'下辖县级市':
									 [],
										 '邮编': '536000'},
						 '来宾': {'下辖县级市':
									 ['合山市', '合山'],
										 '邮编': '546100'},
						 '梧州': {'下辖县级市':
									 ['岑溪市', '岑溪'],
										 '邮编': '543000'},
						 '玉林': {'下辖县级市':
									 ['北流', '北流市'],
										 '邮编': '537000'},
						 '百色市': {'下辖县级市':
									 ['靖西', '靖西市'],
										 '邮编': '533000'},
						 '防城港市': {'下辖县级市':
									 ['东兴', '东兴市'],
										 '邮编': '538000'}}},
			 '湖南': {'下辖地级市':
						 {'湘潭': {'下辖县级市':
									 ['湘乡', '湘乡市', '韶山', '韶山市'],
										 '邮编': '411100'},
						 '娄底': {'下辖县级市':
									 ['冷水江', '冷水江市', '涟源', '涟源市'],
										 '邮编': '417000'},
						 '常德市': {'下辖县级市':
									 ['津市市','津市'],
										 '邮编': '415000'},
						 '常德': {'下辖县级市':
									 ['津市','津市市'],
										 '邮编': '415000'},
						 '湘潭市': {'下辖县级市':
									 ['韶山', '湘乡', '湘乡市', '韶山市'],
										 '邮编': '411100'},
						 '株洲': {'下辖县级市':
									 ['醴陵市', '醴陵'],
										 '邮编': '412000'},
						 '衡阳市': {'下辖县级市':
									 ['常宁市', '耒阳', '常宁', '耒阳市'],
										 '邮编': '421000'},
						 '岳阳': {'下辖县级市':
									 ['临湘', '汨罗', '汨罗市', '临湘市'],
										 '邮编': '414000'},
						 '怀化市': {'下辖县级市':
									 ['洪江市', '洪江'],
										 '邮编': '418000'},
						 '张家界': {'下辖县级市':
									 [],
										 '邮编': '427000'},
						 '永州市': {'下辖县级市':
									 [],
										 '邮编': '425000'},
						 '怀化': {'下辖县级市':
									 ['洪江市', '洪江'],
										 '邮编': '418000'},
						 '邵阳': {'下辖县级市':
									 ['武冈市', '武冈'],
										 '邮编': '422000'},
						 '益阳': {'下辖县级市':
									 ['沅江市', '沅江'],
										 '邮编': '413000'},
						 '张家界市': {'下辖县级市':
									 [],
										 '邮编': '427000'},
						 '郴州': {'下辖县级市':
									 ['资兴市', '资兴'],
										 '邮编': '423000'},
						 '岳阳市': {'下辖县级市':
									 ['临湘', '汨罗市', '汨罗', '临湘市'],
										 '邮编': '414000'},
						 '衡阳': {'下辖县级市':
									 ['常宁市', '耒阳', '常宁', '耒阳市'],
										 '邮编': '421000'},
						 '永州': {'下辖县级市':
									 [],
										 '邮编': '425000'},
						 '郴州市': {'下辖县级市':
									 ['资兴市', '资兴'],
										 '邮编': '423000'},
						 '益阳市': {'下辖县级市':
									 ['沅江市', '沅江'],
										 '邮编': '413000'},
						 '娄底市': {'下辖县级市':
									 ['冷水江', '冷水江市', '涟源', '涟源市'],
										 '邮编': '417000'},
						 '邵阳市': {'下辖县级市':
									 ['武冈市', '武冈'],
										 '邮编': '422000'},
						 '长沙': {'下辖县级市':
									 ['宁乡', '浏阳市', '宁乡市', '浏阳'],
										 '邮编': '410000'},
						 '株洲市': {'下辖县级市':
									 ['醴陵市', '醴陵'],
										 '邮编': '412000'},
						 '长沙市': {'下辖县级市':
									 ['宁乡', '浏阳市', '宁乡市', '浏阳'],
										 '邮编': '410000'}}},
			 '广东省': {'下辖地级市':
						 {'阳江市': {'下辖县级市':
									 ['阳春市', '阳春'],
										 '邮编': '529500'},
						 '云浮': {'下辖县级市':
									 ['罗定', '罗定市'],
										 '邮编': '527300'},
						 '韶关': {'下辖县级市':
									 ['乐昌', '乐昌市', '南雄市', '南雄'],
										 '邮编': '512000'},
						 '梅州': {'下辖县级市':
									 ['兴宁市', '兴宁'],
										 '邮编': '514000'},
						 '清远': {'下辖县级市':
									 ['英德', '英德市', '连州市', '连州'],
										 '邮编': '511500'},
						 '河源市': {'下辖县级市':
									 [],
										 '邮编': '517000'},
						 '佛山市': {'下辖县级市':
									 [],
										 '邮编': '528000'},
						 '惠州市': {'下辖县级市':
									 [],
										 '邮编': '516000'},
						 '河源': {'下辖县级市':
									 [],
										 '邮编': '517000'},
						 '梅州市': {'下辖县级市':
									 ['兴宁市', '兴宁'],
										 '邮编': '514000'},
						 '韶关市': {'下辖县级市':
									 ['乐昌', '乐昌市', '南雄市', '南雄'],
										 '邮编': '512000'},
						 '广州市': {'下辖县级市':
									 [],
										 '邮编': '510000'},
						 '江门市': {'下辖县级市':
									 ['台山', '恩平', '台山市', '恩平市', '鹤山市', '鹤山', '开平市', '开平'],
										 '邮编': '529000'},
						 '汕尾': {'下辖县级市':
									 ['陆丰', '陆丰市'],
										 '邮编': '516600'},
						 '东莞市': {'下辖县级市':
									 [],
										 '邮编': '523000'},
						 '揭阳市': {'下辖县级市':
									 ['普宁市', '普宁'],
										 '邮编': '522000'},
						 '汕头市': {'下辖县级市':
									 [],
										 '邮编': '515000'},
						 '惠州': {'下辖县级市':
									 [],
										 '邮编': '516000'},
						 '江门': {'下辖县级市':
									 ['台山', '恩平', '台山市', '恩平市', '鹤山市', '鹤山', '开平市', '开平'],
										 '邮编': '529000'},
						 '潮州': {'下辖县级市':
									 [],
										 '邮编': '521000'},
						 '茂名市': {'下辖县级市':
									 ['高州市', '信宜', '高州', '信宜市', '化州市', '化州'],
										 '邮编': '525000'},
						 '汕头': {'下辖县级市':
									 [],
										 '邮编': '515000'},
						 '云浮市': {'下辖县级市':
									 ['罗定市', '罗定'],
										 '邮编': '527300'},
						 '深圳市': {'下辖县级市':
									 [],
										 '邮编': '518000'},
						 '潮州市': {'下辖县级市':
									 [],
										 '邮编': '521000'},
						 '中山': {'下辖县级市':
									 [],
										 '邮编': '528400'},
						 '湛江': {'下辖县级市':
									 ['廉江市', '雷州', '廉江', '雷州市', '吴川', '吴川市'],
										 '邮编': '524000'},
						 '肇庆市': {'下辖县级市':
									 ['四会', '四会市'],
										 '邮编': '526000'},
						 '汕尾市': {'下辖县级市':
									 ['陆丰', '陆丰市'],
										 '邮编': '516600'},
						 '清远市': {'下辖县级市':
									 ['英德', '连州市', '英德市', '连州'],
										 '邮编': '511500'},
						 '珠海市': {'下辖县级市':
									 [],
										 '邮编': '519000'},
						 '阳江': {'下辖县级市':
									 ['阳春市', '阳春'],
										 '邮编': '529500'},
						 '佛山': {'下辖县级市':
									 [],
										 '邮编': '528000'},
						 '珠海': {'下辖县级市':
									 [],
										 '邮编': '519000'},
						 '茂名': {'下辖县级市':
									 ['高州市', '信宜', '信宜市', '高州', '化州市', '化州'],
										 '邮编': '525000'},
						 '中山市': {'下辖县级市':
									 [],
										 '邮编': '528400'},
						 '湛江市': {'下辖县级市':
									 ['廉江市', '廉江', '雷州', '雷州市', '吴川', '吴川市'],
										 '邮编': '524000'},
						 '肇庆': {'下辖县级市':
									 ['四会', '四会市'],
										 '邮编': '526000'},
						 '揭阳': {'下辖县级市':
									 ['普宁市', '普宁'],
										 '邮编': '522000'},
						 '深圳': {'下辖县级市':
									 [],
										 '邮编': '518000'},
						 '广州': {'下辖县级市':
									 [],
										 '邮编': '510000'},
						 '东莞': {'下辖县级市':
									 [],
										 '邮编': '523000'}}},
			 '安徽省': {'下辖地级市':
						 {'安庆': {'下辖县级市':
									 ['桐城', '桐城市'],
										 '邮编': '246000'},
						 '淮南': {'下辖县级市':
									 [],
										 '邮编': '232000'},
						 '宿州': {'下辖县级市':
									 [],
										 '邮编': '234000'},
						 '池州市': {'下辖县级市':
									 [],
										 '邮编': '247100'},
						 '池州': {'下辖县级市':
									 [],
										 '邮编': '247100'},
						 '淮北': {'下辖县级市':
									 [],
										 '邮编': '235000'},
						 '六安市': {'下辖县级市':
									 [],
										 '邮编': '237000'},
						 '滁州': {'下辖县级市':
									 ['明光', '天长市', '明光市', '天长'],
										 '邮编': '239000'},
						 '芜湖': {'下辖县级市':
									 [],
										 '邮编': '241000'},
						 '六安': {'下辖县级市':
									 [],
										 '邮编': '237000'},
						 '阜阳市': {'下辖县级市':
									 ['界首市', '界首'],
										 '邮编': '236000'},
						 '亳州': {'下辖县级市':
									 [],
										 '邮编': '236000'},
						 '马鞍山': {'下辖县级市':
									 [],
										 '邮编': '243000'},
						 '宣城市': {'下辖县级市':
									 ['宁国市', '宁国'],
										 '邮编': '242000'},
						 '芜湖市': {'下辖县级市':
									 [],
										 '邮编': '241000'},
						 '宿州市': {'下辖县级市':
									 [],
										 '邮编': '234000'},
						 '合肥': {'下辖县级市':
									 ['巢湖市', '巢湖'],
										 '邮编': '230000'},
						 '蚌埠': {'下辖县级市':
									 [],
										 '邮编': '233000'},
						 '淮南市': {'下辖县级市':
									 [],
										 '邮编': '232000'},
						 '安庆市': {'下辖县级市':
									 ['桐城', '桐城市'],
										 '邮编': '246000'},
						 '铜陵市': {'下辖县级市':
									 [],
										 '邮编': '244000'},
						 '蚌埠市': {'下辖县级市':
									 [],
										 '邮编': '233000'},
						 '合肥市': {'下辖县级市':
									 ['巢湖市', '巢湖'],
										 '邮编': '230000'},
						 '铜陵': {'下辖县级市':
									 [],
										 '邮编': '244000'},
						 '阜阳': {'下辖县级市':
									 ['界首市', '界首'],
										 '邮编': '236000'},
						 '马鞍山市': {'下辖县级市':
									 [],
										 '邮编': '243000'},
						 '亳州市': {'下辖县级市':
									 [],
										 '邮编': '236000'},
						 '淮北市': {'下辖县级市':
									 [],
										 '邮编': '235000'},
						 '黄山': {'下辖县级市':
									 [],
										 '邮编': '245000'},
						 '滁州市': {'下辖县级市':
									 ['明光', '天长市', '明光市', '天长'],
										 '邮编': '239000'},
						 '宣城': {'下辖县级市':
									 ['宁国市', '宁国'],
										 '邮编': '242000'},
						 '黄山市': {'下辖县级市':
									 [],
										 '邮编': '245000'}}},
			 '湖北': {'下辖地级市':
						 {'随州市': {'下辖县级市':
									 ['广水市', '广水'],
										 '邮编': '441300'},
						 '恩施土家族苗族自治州': {'下辖县级市':
									 ['恩施市','利川市','恩施','利川',],
										 '邮编': '445000'},
						 '宜昌': {'下辖县级市':
									 ['宜都', '枝江', '枝江市', '宜都市', '当阳市', '当阳'],
										 '邮编': '443000'},
						 '襄阳市': {'下辖县级市':
									 ['枣阳市', '宜城市', '老河口市', '枣阳', '宜城', '老河口'],
										 '邮编': '441000'},
						 '鄂州': {'下辖县级市':
									 [],
										 '邮编': '436000'},
						 '荆门': {'下辖县级市':
									 ['钟祥', '钟祥市'],
										 '邮编': '448000'},
						 '十堰': {'下辖县级市':
									 ['丹江口', '丹江口市'],
										 '邮编': '442000'},
						 '孝感': {'下辖县级市':
									 ['安陆市', '应城市', '汉川市', '应城', '汉川', '安陆'],
										 '邮编': '432000'},
						 '黄冈市': {'下辖县级市':
									 ['麻城', '武穴', '麻城市', '武穴市'],
										 '邮编': '438000'},
						 '襄阳': {'下辖县级市':
									 ['枣阳市', '宜城市', '老河口市', '枣阳', '宜城', '老河口'],
										 '邮编': '441000'},
						 '荆门市': {'下辖县级市':
									 ['钟祥', '钟祥市'],
										 '邮编': '448000'},
						 '宜昌市': {'下辖县级市':
									 ['宜都', '枝江', '枝江市', '宜都市', '当阳市', '当阳'],
										 '邮编': '443000'},
						 '咸宁市': {'下辖县级市':
									 ['赤壁', '赤壁市'],
										 '邮编': '437000'},
						 '黄冈': {'下辖县级市':
									 ['武穴', '麻城', '武穴市', '麻城市'],
										 '邮编': '438000'},
						 '荆州市': {'下辖县级市':
									 ['洪湖', '洪湖市', '石首', '松滋市', '石首市', '松滋'],
										 '邮编': '434000'},
						 '武汉市': {'下辖县级市':
									 [],
										 '邮编': '430000'},
						 '黄石': {'下辖县级市':
									 ['大冶', '大冶市'],
										 '邮编': '435000'},
						 '咸宁': {'下辖县级市':
									 ['赤壁', '赤壁市'],
										 '邮编': '437000'},
						 '荆州': {'下辖县级市':
									 ['洪湖', '洪湖市', '石首', '松滋市', '石首市', '松滋'],
										 '邮编': '434000'},
						 '武汉': {'下辖县级市':
									 [],
										 '邮编': '430000'},
						 '黄石市': {'下辖县级市':
									 ['大冶', '大冶市'],
										 '邮编': '435000'},
						 '随州': {'下辖县级市':
									 ['广水市', '广水'],
										 '邮编': '441300'},
						 '十堰市': {'下辖县级市':
									 ['丹江口', '丹江口市'],
										 '邮编': '442000'},
						 '鄂州市': {'下辖县级市':
									 [],
										 '邮编': '436000'},
						 '孝感市': {'下辖县级市':
									 ['安陆市', '应城市', '汉川市', '应城', '汉川', '安陆'],
										 '邮编': '432000'}}},
			 '云南': {'下辖地级市':
						 {'昭通市': {'下辖县级市':
									 [],
										 '邮编': '657000'},
						 '楚雄彝族自治州': {'下辖县级市':
										 ['楚雄市','楚雄'],
											 '邮编':'675000'},
						 '红河哈尼族彝族自治州': {'下辖县级市':
										 ['蒙自市','个旧市','开远市','弥勒市','蒙自','个旧','开远','弥勒'],
											 '邮编':'661400'},
						 '文山壮族苗族自治州': {'下辖县级市':
										 ['文山市','文山'],
											 '邮编':'663000'},
						 '西双版纳傣族自治州': {'下辖县级市':
										 ['景洪市','景洪'],
											 '邮编':'666100'},
						 '大理白族自治州': {'下辖县级市':
										 ['大理市','大理'],
											 '邮编':'671000'},
						 '德宏傣族景颇族自治州': {'下辖县级市':
										 ['芒市','瑞丽市','瑞丽'],
											 '邮编':'678400'},
						 '迪庆藏族自治州': {'下辖县级市':
										 ['香格里拉市','香格里拉'],
											 '邮编':'674400'},
						 '怒江傈僳族自治州': {'下辖县级市':
										 ['泸水市','泸水'],
											 '邮编':'673200'},
						 '楚雄': {'下辖县级市':
										 ['楚雄市','楚雄'],
											 '邮编':'675000'},
						 '红河': {'下辖县级市':
										 ['蒙自市','个旧市','开远市','弥勒市','蒙自','个旧','开远','弥勒'],
											 '邮编':'661400'},
						 '文山': {'下辖县级市':
										 ['文山市','文山'],
											 '邮编':'663000'},
						 '西双版纳': {'下辖县级市':
										 ['景洪市','景洪'],
											 '邮编':'666100'},
						 '大理': {'下辖县级市':
										 ['大理市','大理'],
											 '邮编':'671000'},
						 '德宏': {'下辖县级市':
										 ['芒市','瑞丽市','瑞丽'],
											 '邮编':'678400'},
						 '迪庆': {'下辖县级市':
										 ['香格里拉市','香格里拉'],
											 '邮编':'674400'},
						 '怒江': {'下辖县级市':
										 ['泸水市','泸水'],
											 '邮编':'673200'},
						 '昆明': {'下辖县级市':
									 ['安宁', '安宁市'],
										 '邮编': '650000'},
						 '临沧市': {'下辖县级市':
									 [],
										 '邮编': '677000'},
						 '普洱': {'下辖县级市':
									 [],
										 '邮编': '665000'},
						 '昆明市': {'下辖县级市':
									 ['安宁', '安宁市'],
										 '邮编': '650000'},
						 '保山市': {'下辖县级市':
									 ['腾冲市', '腾冲'],
										 '邮编': '678000'},
						 '曲靖': {'下辖县级市':
									 ['宣威', '宣威市'],
										 '邮编': '655000'},
						 '丽江': {'下辖县级市':
									 [],
										 '邮编': '674100'},
						 '丽江市': {'下辖县级市':
									 [],
										 '邮编': '674100'},
						 '玉溪': {'下辖县级市':
									 [],
										 '邮编': '653100'},
						 '临沧': {'下辖县级市':
									 [],
										 '邮编': '677000'},
						 '曲靖市': {'下辖县级市':
									 ['宣威', '宣威市'],
										 '邮编': '655000'},
						 '玉溪市': {'下辖县级市':
									 [],
										 '邮编': '653100'},
						 '普洱市': {'下辖县级市':
									 [],
										 '邮编': '665000'},
						 '保山': {'下辖县级市':
									 ['腾冲市', '腾冲'],
										 '邮编': '678000'},
						 '昭通': {'下辖县级市':
									 [],
										 '邮编': '657000'}}},
			 '吉林': {'下辖地级市':
						 {'松原市': {'下辖县级市':
									 ['扶余市', '扶余'],
										 '邮编': '138000'},
						 '白山市': {'下辖县级市':
									 ['临江市', '临江'],
										 '邮编': '134300'},
						 '长春市': {'下辖县级市':
									 ['榆树市', '德惠市', '榆树', '德惠'],
										 '邮编': '130000'},
						 '四平': {'下辖县级市':
									 ['公主岭', '双辽市', '公主岭市', '双辽'],
										 '邮编': '136000'},
						 '白山': {'下辖县级市':
									 ['临江市', '临江'],
										 '邮编': '134300'},
						 '延边朝鲜族自治州': {'下辖县级市':
									 ['延吉市','图们市','敦化市','龙井市','珲春市','和龙市','延吉','图们','敦化','龙井','珲春','和龙'],
										 '邮编': '133000'},
						 '吉林市': {'下辖县级市':
									 ['舒兰市', '磐石市', '桦甸市', '蛟河市', '桦甸', '蛟河', '磐石', '舒兰'],
										 '邮编': '132000'},
						 '白城': {'下辖县级市':
									 ['大安市', '大安', '洮南市', '洮南'],
										 '邮编': '137000'},
						 '四平市': {'下辖县级市':
									 ['双辽', '公主岭市', '双辽市', '公主岭'],
										 '邮编': '136000'},
						 '长春': {'下辖县级市':
									 ['榆树市', '德惠市', '榆树', '德惠'],
										 '邮编': '130000'},
						 '白城市': {'下辖县级市':
									 ['大安市', '大安', '洮南', '洮南市'],
										 '邮编': '137000'},
						 '通化市': {'下辖县级市':
									 ['集安市', '梅河口', '集安', '梅河口市'],
										 '邮编': '134000'},
						 '辽源': {'下辖县级市':
									 [],
										 '邮编': '136200'},
						 '松原': {'下辖县级市':
									 ['扶余市', '扶余'],
										 '邮编': '138000'},
						 '辽源市': {'下辖县级市':
									 [],
										 '邮编': '136200'},
						 '通化': {'下辖县级市':
									 ['梅河口', '集安', '集安市', '梅河口市'],
										 '邮编': '134000'},
						 '吉林': {'下辖县级市':
									 ['舒兰市', '磐石市', '桦甸市', '磐石', '桦甸', '蛟河', '蛟河市', '舒兰'],
										 '邮编': '132000'}


										 }}
}



window = makeWidgets()
window.mainloop()
